{"subreddit":{"0":"CryptoCurrency","1":"CryptoCurrency","2":"CryptoCurrency","3":"CryptoCurrency","4":"CryptoCurrency","5":"CryptoCurrency","6":"CryptoCurrency","7":"CryptoCurrency","8":"CryptoCurrency","9":"CryptoCurrency","10":"CryptoCurrency","11":"CryptoCurrency","12":"CryptoCurrency","13":"CryptoCurrency","14":"CryptoCurrency","15":"CryptoCurrency","16":"CryptoCurrency","17":"CryptoCurrency","18":"CryptoCurrency","19":"CryptoCurrency","20":"CryptoCurrency","21":"CryptoCurrency","22":"CryptoCurrency","23":"CryptoCurrency","24":"CryptoCurrency","25":"CryptoCurrency","26":"CryptoCurrency","27":"CryptoCurrency","28":"CryptoCurrency","29":"CryptoCurrency","30":"CryptoCurrency","31":"CryptoCurrency","32":"CryptoCurrency","33":"CryptoCurrency","34":"CryptoCurrency","35":"CryptoCurrency","36":"CryptoCurrency","37":"CryptoCurrency","38":"CryptoCurrency","39":"CryptoCurrency","40":"CryptoCurrency","41":"CryptoCurrency","42":"CryptoCurrency","43":"CryptoCurrency","44":"CryptoCurrency","45":"CryptoCurrency","46":"CryptoCurrency","47":"CryptoCurrency","48":"CryptoCurrency","49":"CryptoCurrency","50":"CryptoCurrency","51":"CryptoCurrency","52":"CryptoCurrency","53":"CryptoCurrency","54":"CryptoCurrency","55":"CryptoCurrency","56":"CryptoCurrency","57":"CryptoCurrency","58":"CryptoCurrency","59":"CryptoCurrency","60":"CryptoCurrency","61":"CryptoCurrency","62":"CryptoCurrency","63":"CryptoCurrency","64":"CryptoCurrency","65":"CryptoCurrency","66":"CryptoCurrency","67":"CryptoCurrency","68":"CryptoCurrency","69":"CryptoCurrency","70":"CryptoCurrency","71":"CryptoCurrency","72":"CryptoCurrency","73":"CryptoCurrency","74":"CryptoCurrency","75":"CryptoCurrency","76":"CryptoCurrency","77":"CryptoCurrency","78":"CryptoCurrency","79":"CryptoCurrency","80":"CryptoCurrency","81":"CryptoCurrency","82":"CryptoCurrency","83":"CryptoCurrency","84":"CryptoCurrency","85":"CryptoCurrency","86":"CryptoCurrency","87":"CryptoCurrency","88":"CryptoCurrency","89":"CryptoCurrency","90":"CryptoCurrency","91":"CryptoCurrency","92":"CryptoCurrency","93":"CryptoCurrency","94":"CryptoCurrency","95":"CryptoCurrency","96":"CryptoCurrency","97":"CryptoCurrency","98":"CryptoCurrency","99":"CryptoCurrency","100":"CryptoMarkets","101":"CryptoMarkets","102":"CryptoMarkets","103":"CryptoMarkets","104":"CryptoMarkets","105":"CryptoMarkets","106":"CryptoMarkets","107":"CryptoMarkets","108":"CryptoMarkets","109":"CryptoMarkets","110":"CryptoMarkets","111":"CryptoMarkets","112":"CryptoMarkets","113":"CryptoMarkets","114":"CryptoMarkets","115":"CryptoMarkets","116":"CryptoMarkets","117":"CryptoMarkets","118":"CryptoMarkets","119":"CryptoMarkets","120":"CryptoMarkets","121":"CryptoMarkets","122":"CryptoMarkets","123":"CryptoMarkets","124":"CryptoMarkets","125":"CryptoMarkets","126":"CryptoMarkets","127":"CryptoMarkets","128":"CryptoMarkets","129":"CryptoMarkets","130":"CryptoMarkets","131":"CryptoMarkets","132":"CryptoMarkets","133":"CryptoMarkets","134":"CryptoMarkets","135":"CryptoMarkets","136":"CryptoMarkets","137":"CryptoMarkets","138":"CryptoMarkets","139":"CryptoMarkets","140":"CryptoMarkets","141":"CryptoMarkets","142":"CryptoMarkets","143":"CryptoMarkets","144":"CryptoMarkets","145":"CryptoMarkets","146":"CryptoMarkets","147":"CryptoMarkets","148":"CryptoMarkets","149":"CryptoMarkets","150":"CryptoMarkets","151":"CryptoMarkets","152":"CryptoMarkets","153":"CryptoMarkets","154":"CryptoMarkets","155":"CryptoMarkets","156":"ethtrader","157":"ethtrader","158":"ethtrader","159":"ethtrader","160":"ethtrader","161":"ethtrader","162":"ethtrader","163":"ethtrader","164":"ethtrader","165":"ethtrader","166":"ethtrader","167":"ethtrader","168":"ethtrader","169":"ethtrader","170":"ethtrader","171":"ethtrader","172":"ethtrader","173":"ethtrader","174":"ethtrader","175":"ethtrader","176":"ethtrader","177":"ethtrader","178":"ethtrader","179":"ethtrader","180":"ethtrader","181":"ethtrader","182":"ethtrader","183":"ethtrader","184":"ethtrader","185":"ethtrader","186":"ethtrader","187":"ethtrader","188":"ethtrader","189":"ethtrader","190":"ethtrader","191":"ethtrader","192":"ethtrader","193":"ethtrader","194":"ethtrader","195":"ethtrader","196":"ethtrader","197":"ethtrader","198":"ethtrader","199":"ethtrader","200":"ethtrader","201":"ethtrader","202":"ethtrader","203":"ethtrader","204":"ethtrader","205":"ethtrader","206":"ethtrader","207":"ethtrader","208":"ethtrader","209":"ethtrader","210":"ethtrader","211":"ethtrader","212":"ethtrader","213":"ethtrader","214":"ethtrader","215":"ethtrader","216":"ethtrader","217":"ethtrader","218":"ethtrader","219":"ethtrader","220":"ethtrader","221":"ethtrader","222":"ethtrader","223":"ethtrader","224":"ethtrader","225":"ethtrader","226":"ethtrader","227":"ethtrader","228":"ethtrader","229":"ethtrader","230":"ethtrader","231":"ethtrader","232":"ethtrader","233":"ethtrader","234":"ethtrader","235":"ethtrader","236":"ethtrader","237":"ethtrader","238":"ethtrader","239":"ethtrader","240":"ethtrader","241":"ethtrader","242":"ethtrader","243":"ethtrader","244":"ethtrader","245":"ethtrader","246":"ethtrader","247":"ethtrader","248":"ethtrader","249":"ethtrader","250":"ethtrader","251":"ethtrader","252":"ethtrader","253":"ethtrader","254":"ethtrader","255":"ethtrader","256":"BitcoinMarkets"},"title":{"0":"No, leaving your crypto on an exchange is not the end of the world and you don't have to move your $100 woth of crypto to a cold wallet","1":"Brace yourselves: In the coming weeks, crypto markets will explode like you’ve never seen. Here are some essential tips to survive the madness.","2":"Ethereum just had it's first ever deflationary day.","3":"Stellar (XLM) Consumes Less Energy per Transaction than even VISA while being Practically as Fast","4":"The Bitcoin golden cross is still on track to form in September for the first time in 1.5 years and may keep the rally going to take BTC to $100,000.","5":"Your $100 investment won't make you rich.","6":"Ethereum is now the 18th most valuable asset in the world, beating companies Johnson &amp; Johnson and Samsung","7":"We’re now at the Floor Market Cap (2T) of the Next Bull Cycle: We’re Heading to 10T Market Cap This Bull Cycle","8":"IOTA is up +92% compared to last week! Now at $1.93","9":"Surprise Surprise... SEC Refuses to Produce Documents Related to Employees’ XRP, Bitcoin, Ethereum Holdings","10":"If you use Brave to Earn BAT, You can Use XLM to Circumvent Insane Exchange Fees and Move it For Free","11":"Daily Discussion - September 5, 2021 (GMT+0)","12":"Post a coin and I will tell you why it's a smart investment.","13":"77% of Russian investors prefer Bitcoin to Gold, survey reveals","14":"Cashed out for the first time!","15":"Proof that anyone buying now is still insanely early","16":"The golden cross is inevitable within DAYS!","17":"750 Million dollars worth of ETH have been burned over the last month","18":"NSA doesn't think Quantum Computers can Break Cryptocurrency (Public Key Encryption)","19":"CryptoPunks Zombie Receives Bids a $6,270,000 or 1600 ETH","20":"SafeMoons is Down 20% in 7 Days, 80% from All Time High while the whole Market is Bullish","21":"Finally an end to the requests for your top portfolio picks or next 100x coins. I present to you the Random Crypto Opinion Generator","22":"A father and son who help clients find forgotten crypto passwords estimate billions of dollars worth of lost bitcoin is recoverable","23":"Your weekly dose of Crypto","24":"|QUESTION| What was, your biggest regret on Crypto?","25":"Crypto is providing supplies for my students","26":"How To Store Your Crypto Securely? - A comprehensive analysis of the exchange CHADS vs the hardware wallet BRADS.","27":"Unpopular Opinion: I love Binance","28":"All aboard the MATIC train! We just kicked in the nitrous for this hill climb!","29":"Survey Shows 1 In 10 U.S. Investors Own Crypto Despite Seeing It As A Risky Asset - 1 in 10 we are still crazy early","30":"If you got into crypto to acquire life changing money, fair play. Just have a realistic timeline","31":"You hear about DCA and hodl, but you never heard how to take profits and navigate your way out of the market. I learned what indicates a cycle top so you don't have to.","32":"You can now pay with Bitcoin, Ethereum, and Dogecoin in parking lots in the capital city of Belgium","33":"9 Lessons From A Crypto Veteran","34":"For your Own Safety: Do not Short Bitcoin or Ethereum, Over $200M Lost Each Day for Over 60.000 Traders","35":"Do people still not understand ICP is a scam coin?","36":"Over $1billion Stacked Into IOTA With 25% Price Spike In 24hours","37":"You don’t need a lot money to invest in crypto","38":"What is your goal in crypto?","39":"In just 24 hours, over 69,000 traders were liquidated, for a combined total of $239m","40":"Your Weekly Dose Of Crypto - Week 1","41":"Timing the market is difficult. Unless you’re experienced and knowledgeable, stop trading your crypto repeatedly to chase gains - because even then it’s still tough.","42":"Just had to cash out a bit…","43":"Do you also find it funny that all stock traders are calling for a market crash soon? We've seen more than -60% in our portfolio a few weeks ago already lol.","44":"Monero","45":"SundaeSwap Clears Misconceptions Amid Recent Cardano Controversy","46":"If people start using their brain on fixing base chains and second layers instead of creating new crypto all money would concentrate in less places and we could see a huge spike but no y’all want 11,500 different cryptocurrencies","47":"Will crypto be the death of big budget heist movies?","48":"This sub can be amazing at times !","49":"Crypto is a hobby for you and shouldn't dominate every aspect of your life","50":"eBay Now Allows the Sale of NFTs on its Platform","51":"Satoshi Nakamotos First Post: Banks must be Trusted not to Debase the Currency, but the History of Fiat Currencies is Full of Breaches of Trust, Lend it Out in Waves of Credit Bubbles with Barely a Fraction in Reserve","52":"Sen. Elizabeth Warren says 'crypto is the new shadow bank' aka let's give something we don't understand a bad name to scare people.","53":"Lets say you 10x your holdings. What's your plan?💰💸","54":"Banks fighting back","55":"Official Response by IOHK: \"IMPORTANT THREAD: Over the past 24 hours we have seen a lot of social media speculation (and let's face it, outright FUD &amp; misinformation) over Cardano’s ledger approach and specifically ‘concurrency’. Let’s clear this up.\"","56":"Newcomers, Hodl tight. Institutions may try to shake you out soon.","57":"The good thing about the whole corona was that me and alot of my homies got into crypto during it. How many of you started buying crypto during corona lockdown?","58":"Only 207 people have participated in 16 rounds of Moons","59":"What crypto is ideal to accept in a café?","60":"Took me way too long in life to realize how much of a waste of time gambling is - Thanks to Crypto.","61":"Ethereum: Beginner Basics","62":"Bullish on LINK; The silent HAWK","63":"Sen. Pat Toomey (R-PA), the ranking member of the Senate Banking Committee, said “Rather than trying to ignore or suppress cryptocurrency and related technologies, regulators and legislators alike need to recognize that open, public networks are here to stay,”","64":"Ethereum's 'ascent unstoppable' and has 'very high potential' to overtake Bitcoin","65":"Why do you ACTUALLY think crypto will be big? Take out the fact you want it to be big.","66":"Biggest joke of the day is the ten worst performing cryptocurrencies in august according entrepeneur","67":"Bitcoin or Stupid Shit?","68":"Do I have a shot at selling NFTs as a photographer ?","69":"Tether Hack shows that Tether can Freeze All your USDT anytime they want to","70":"3 main threats to your funds in the crypto universe and how to get rid of them","71":"I don’t understand why people are hesitant to use crypto to buy things due to future price increases","72":"36 BTC were traded last week in Venezuela only measured using LocalBitcoin. That is 10% of the worldwide volume. In 4 weeks, six zeroes will removed from the currency (Bolivares), so 1,000,000 Bs. will be 1 Bs (BTW current value of 1 moon). Monthly minimum wage sits at 2.5 USD.","73":"While most people don't suggest day trading, I say give it a shot","74":"Dont tell me i didint warn you, SERIOUS, BEWARE of Increasingly Sophisticated Malware infection attempts","75":"77% of Russian investors prefer Bitcoin to Gold, survey reveals","76":"8 hours a day tied to a desk. All in on crypto. Bosh.","77":"Big potential for a bull run","78":"Is it wise to pay for living expenses with your crypto?","79":"The truth about IOTA rising +90%","80":"DCA is key if you are in the long run","81":"YSK: ERC-20 tokens are just a balance tied to your address in a smart contract, and are not stored in your wallet.","82":"Ever thought about how fiat is mined?","83":"For me, Investing in crypto is more profitable rather than keeping the money stagnant in bank.","84":"Shower Thought: How Many Coins Do We Need?","85":"The final major BTC sell off next week between 9\/13-9\/17 will be the last before we see 118k by thanksgiving.","86":"BULL RUN : Bitcoin Price to Hit $100,000 by End of 2021: Chainalysis CEO","87":"Finally in the green! Been nearly 4 months!","88":"Bitcoin dominance dips below 40% of the crypto market economy which now totals $2.36 trillion. Ethereum and other crypto growth continues to outpace","89":"Came for the money stayed for the tech.","90":"Monero-mining malware expels other malware from your computer and even improves its security","91":"No matter your budget. You support our Future and i’m thankful for everyone","92":"Deloitte’s annual Blockchain study: “The fiat currency will be gone within 5 to 10 years”","93":"How do guys get others around you to invest into Crypto?","94":"Cheap Power Brings Bitcoin Mining Boom to Venezuela as Country Moves Toward Digital Economy","95":"Moons after mainnet!!!","96":"You're losing money by not staking POS inflationary cryptocurrencies you hold","97":"A father and son who help clients find forgotten crypto passwords estimate billions of dollars worth of lost bitcoin is recoverable","98":"Here is a list of my coins I DCA - and why. What are your reasons?","99":"Libya Ranked 1st Among Arab Countries in Bitcoin Mining","100":"When you buy 1 billion of shitcoin for $100","101":"Apart from Bitcoin, many of the crypto &amp; blockchain projects are centralized. Projects are being driven to a considerable extent by a group of developers who may be serving their own self-interests or those of some large and influential organizations","102":"How to invest in Crypto","103":"What? You guys haven’t discussed IOTA yet?","104":"Bitcoin Briefly Crosses $50,000 Milestone","105":"Due to the outrageous demands and embargo credit Banks placed on obtaining loans, there’s minimal competition in the centralized finance space. BNPL is a decentralized alternative, where users can apply for a loan without any collateral and enjoy full autonomy to operating their business","106":"Cryptocurrencies Gain Legal Status in Texas as New Laws Take Effect","107":"Crypto market exit strategy?","108":"\"So what do you do for a living?\"","109":"Top 5 Free Cryptohopper Apps for Every User [2021]","110":"Bull markets: bad for sleep quality?","111":"Will Dogecoin Ever Reach one dollar? -Explained","112":"Guide to Invest in Cryptocurrency from India [2021]","113":"Plutus Pioneer made me dump Ada","114":"Not many people are aware that IOTA surged 45% within a week","115":"Staking at Binance: Is it safe to Stake on Binance? [2021]","116":"The one bad thing about bull runs is that people get too excited and start investing in shady projects with offers too good to be true.","117":"Is there a way to make an algorithm that trades with paper money?","118":"Gold, bond portfolios are ‘naked’ without Bitcoin – Analyst","119":"How to download Char Champions videos?","120":"How to find good coins to invest in?","121":"Guide to Invest in Cryptocurrency from India [2021]","122":"Join the Anti-Whale revolution!","123":"Is it just me, or do you also think predicting prices in a bull market is harder than in a bear market ?","124":"Published on YouTube: CryptoPunks Zombie sells for $3.9M | Seety launches Bitcoin Payment | Crypto News: 5\/09\/21","125":"OKEx Review 2021: Is it legit or a Scam?","126":"Ethereum: Beginner Basics","127":"Weekly Discussion Megathread - September 5, 2021 (GMT+0)","128":"Staking at Binance: Is it safe to Stake on Binance? [2021]","129":"Top 5 Free Cryptohopper Apps for Every User [2021]","130":"Bitcoin 'super cycle' stalls, but hash rate is full of promise","131":"10k in eth or btc?","132":"Check out the new Crypto Exchange launching soon. BSC token launches September 18th","133":"Great news","134":"Published on YouTube: CryptoPunks Zombie sells for $3.9M | Seety launches Bitcoin Payment | Crypto News: 5\/09\/21","135":"How to Buy Shiba (SHIB) Coin on WazirX? [2021]","136":"Y'all see CDC on ESPN? I did, it was awesome.","137":"The Absolute Beginner’s Guide To Cryptocurrency Investing","138":"QTUM is in play","139":"Some advice for a beginner","140":"OKEx Review 2021: Is it legit or a Scam?","141":"7 Changes in Uniswap V3 and LP Impacts | Decentralised Market Maker + CLOB","142":"14th KuCoin Spotlight: Introducing IX Swap - World's First DeFi AMM and Liquidity Pools","143":"New infortmation about cardano","144":"Which bank would accept receiving the equivalent of 100btc ?","145":"Instagram account to explain what is crypto as easily as possible","146":"Binance vs Coinbase: Which is the best? [2021]","147":"Hodlnaut Review 2021 – Earn Interest on Your Bitcoin [Updated]","148":"Binance vs Coinbase: Which is the best? [2021]","149":"How to buy Shiba (SHIB) Coin on CoinDCX? [2021]","150":"I NEED HELP ON: How to SWAP BTC TO ETH (WITHOUT ID)","151":"How to Buy Shiba (SHIB) Coin on WazirX? [2021]","152":"How to buy Shiba (SHIB) Coin on CoinDCX? [2021]","153":"Abstract Inu Token with NFT Museum Launched Today","154":"Hodlnaut Review 2021 – Earn Interest on Your Bitcoin [Updated]","155":"Elon Musk Backs Dogecoin Upgrade, Claiming It Could Outperform Other Coins 'Hands Down'...","156":"To the outside, someone with a $100,000 car appears to be winning, but in my opinion, the person with the $100,000 portfolio is the real winner.","157":"Ethereum is now the 19th most valuable asset in the world by market cap.","158":"What do you think?","159":"Sold for 1000 ETH !","160":"Crypto drama . lmao 😂","161":"Do any of you guys have NFTs?","162":"Crypto on a swing here.","163":"Ya ever try and just take a moment to appreciate that we're are all very lucky to have money to invest, even if it is only a couple hundred dollars or whatever. So many people are economically ravaged and drain every last penny just to keep the lights on.","164":"Currently the same price !!","165":"Quite true, in a figurative sense","166":"1 ETH just feels and sounds better!","167":"People paying $millions for jpegs and they think ETH going to $50k is impossible. It's coming.","168":"People like you","169":"At least make ur bed homies","170":"This is when you know you are financially literate and destined for enormous wealth","171":"How I visualise ETH chasing the ATH","172":"These days, sleeping is hard","173":"Who else was hooked after they made their first dollar from their investments?","174":"😂 fuck the feds and buy crypto. Lol","175":"Ethereum's upgrade path.","176":"Unpopular Opinion: For most people, it’s not a bad idea to keep their crypto in an exchange.","177":"What a week for ETH!!","178":"Always defend what you believe in 👌","179":"Don’t be this guy!!","180":"With Vitalik being on the Doge board, I wonder if Doge hops onto the Ethereum chain and if copycats try to follow.","181":"Following accounts are involved in an upvote for upvote scheme for farming Karma and Donuts:","182":"Every . single . fooking . time","183":"Definitely haven't sold crypto to buy back in at a lower price only for it to go higher and panic buy in again. 😅","184":"You know what really pisses me off?","185":"Just do it","186":"We’re gonna overtake that very soon…","187":"That’s a smart kid!","188":"Ethereum: Beginner Basics","189":"ETH above 3.9k and this is my view from Destin, FL. When ETH hits 10k I’ll see you boys in Cabo. LFG","190":"ETH Owner not a 'Doge' owner..","191":"Newcomers, Hodl tight. Institutions may try to shake you out of your ETH soon.","192":"Don't fall ETH, don't fall!","193":"Damn,They are fast!","194":"Believe.","195":"Keep burning baby","196":"Words of Wisdom","197":"YeFi CEO: Ethereum to be ‘global computer’ bigger than AWS, Azure, and Google combined","198":"The big DON’Ts of crypto!","199":"This guy is fucked.","200":"The flippening has already happened in traded volumes (via zerohedge)","201":"(Official Website) Ethereum node will eventually be able to run on your phone! 📲","202":"She will friendzone you if you buy jpeg 🤣","203":"How are feeling on Ethereum’s 1st Deflationary Day?!","204":"We are still early with Ethereum 🦇🔊","205":"Some things are inevitable!","206":"People were doubting that EIP-1559 could lead to deflationary ETH. It has come true!","207":"ETH hidden depth","208":"Amitabh Bachchan, Bollywood actor And Sunny Leone makes NFT debut","209":"A father and son who help clients find forgotten crypto passwords estimate billions of dollars worth of lost crypto is recoverable","210":"Choices","211":"Not quite an Ethereum killer. Cardano smart contracts, as told by Seinfeld.","212":"iMac: 2021 v. 1998. Perspective. we are still early.","213":"Life as a new trader","214":"DONT do like that! Its NEVER, late to buy ETH!","215":"$ETH Number of Addresses Receiving from Exchanges (7d MA) just reached a 3-month high","216":"Assessing Ethereum’s likelihood of surging to $4500 soon","217":"are you?","218":"Will there be a correction?","219":"In a Crypto World, Ethereum Rules as King!","220":"Ethereum Is 'Dragging' Other Crypto Assets Higher, According to Chainalysis CEO","221":"SEC refuses to produce documents related to employees’ XRP, Bitcoin, Ethereum holdings","222":"Ethereum records negative daily issuance for first time after EIP-1559","223":"It's only a hobby for me bro ! No I totally haven't gone balls deep","224":"August altcoin race!","225":"ETH to retest all-time-high after minor pullback","226":"Don’t get stressed out if you see a dip","227":"I have 10k DONUT sitting from March, will it expire?","228":"Buying 1 million shitcoins for 100 dollars feels like...","229":"I Sold this Cock NFT for 6.9420 ETH!","230":"The 'Social crypto' ETH. Brings people together. Cheers sub buddies :)","231":"Utopia Peer-to-Peer Introduces Anonymous USD Stablecoin that will provide fully untraceable transactions that are pegged to the US Dollar","232":"7 Changes in Uniswap V3 and LP Impacts | Decentralised Market Maker + CLOB","233":"ETH gas fees","234":"LIFE is something I’m putting very high up on the radar and you should too!","235":"(Mega Bullish) $54M ETH burned: Ethereum records first deflationary day","236":"(LOL, the answer is obvious) If You Had $5,000 Right Now, Would You Put It On Ethereum Or Baby Dogecoin?","237":"Yes, waterfall model is the most successful model being used today. \/s","238":"Donut earners in third world countries be like...","239":"Stay away from r\/CryptoMoonShots","240":"Ethereum has its first ever deflationary day thanks to EIP1559 and NFT boom","241":"Falling trading volume is a warning sign imho... It's better to invest in ETH than NFTs for 99% of investors!","242":"More Than 200,000 Ethereum Burned By Eip-1559","243":"When You Buy an NFT, You Don’t Completely Own It – Here’s Why","244":"Ethereum Price Analysis: ETH sets higher low, ready to break $4,000 again?","245":"New Ethereum-based NFT Project From Artist Behind The Bored Ape Yacht Club","246":"What can cause this kind of spike (in Ethereum Sept 4th at 18H on 4H chart from Binance Future Data)","247":"Cryptocurrencies Gain Legal Status in Texas as New Laws Take Effect","248":"Poster for new Apple show looks familie…","249":"ETHEREUM IS THE NEXT BITCOIN IN 2021 Full History Price Predictions &amp; Technical Analysis","250":"Economics writer destroys diamond to turn it into an Ethereum-based NFT as an experiment","251":"Tell me your favorite crypto-related joke","252":"More Than 200,000 ETH Burned by EIP-1559","253":"Some benefits of a hardware wallet","254":"Cryptocurrency can actually make a difference by helping people","255":"Is it still possible to claim Donuts on xdai sidechain.","256":"[Daily Discussion] - Sunday, September 05, 2021"},"content":{"0":"Maybe it is just me but I totally trust exchanges to take care of my crypto. Of course I am speaking of popular and trustworthy exchanges. Leaving your crypto on an exchange nobody has ever heard of is of course a dumb idea.\n\nBut do you want to tell me that your crypto is not safe on Coinbase, Kraken, Gemini, Crypto.com or Voyager? It is 2021 and not 2014 and these exchanges can not be compared to Mt Gox.\n\nAlso sometimes people get the whole \"not your keys, not your crypto\" thing too seriously. I have seen people here complainig that they lost a big amount of their ETH to move it to a cold wallet. Well, high gas fees are another topic but you definitely shouldn't move your crypto to a wallet if you have to lose like 1\/4 of it to do that. If you just have 0.05 ETH or similar then just leave it on the exchange. Nothing will happen to it.\n\nNot to mention that if you are new in crypto then it is more likely for you to lose your piece of paper with your seed phrase than an exchange like Kraken or Coinbase to get hacked. If you ever accumulate a bigger amount of crypto then you could think about buying a cold wallet!\n\nPS I originally [posted this](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phepj2\/no_leaving_your_crypto_on_an_exchange_is_not_the\/) on friday but it got deleted for mentioning ETH in the title because there were already many posts about ETH. But my post was doing very well and most people seemed to agree so I decided to change the title and repost it today!","1":"\n\t1. “Hodl” is a meme for suckers.\n\nAs prices climb you‘ll start to hear a lot about hodling. [insert 300 and Braveheart meme here]. Just FYI: “Hodl” comes from the early days when folks completely forgot about their Bitcoins until one day they heard on the news that this nerd money passed $1k\/coin. They dug out their old wallet (if they were lucky enough to still have access) and thus woke up millionaires.  In short: their inadvertent holding made them exceedingly wealthy. \n\nThe fact is that “hodl” doesn’t mean “never sell” it just means “try not to sell before you’re satisfied.” There’s nothing noble about “never selling” your coins—you tell yourself you’ll hodl through thick and thin—watch the comments like “I’m in cold storage and just grabbing the popcorn” while the market is in free fall.—but that means you have no idea just how cold crypto winter can get.\n\nYour “loyalty” will mean jack-all when your portfolio has gone from $300k to $3k. \n\n\t2. Take the Money and Run:\n\nSet a goal and STICK TO IT. If you’ve made life changing money, or just enough for that goal: a new car, a new computer, college loans, etc.—don’t roll the profits over into the next coin poised to explode —  just take the money and run. Do what you planned to with it, celebrate, and enjoy your success (no matter what that success looks like). The bear will come and you can buy back in.\n\nGreed is a bottomless pit and always chasing “a little bit more” will never make you happy. Remember that meme of the dude at the party standing in the corner while everyone else is having fun: “They dont know i have ETH.” \n\nNews flash: yes they do. But even so, living is way more important than hodling—and the people dancing, having a genuinely good time living life, are in a way better position than the guy in the corner with his ETH.\n\n\t3. You don’t start spending the money until you’ve lost the money.\n\nI remember the first time I experienced my portfolio climbing $5k\/$10k per day. It was insanity. All of a sudden money became cheap. Easy to throw away, easy to take for granted. Amounts of money that I had never dreamed could have become accessible to me had suddenly become nothing more than crumbs. \n\nIt wasn’t until the proceeding bear market—when it had ‘dip’-by-‘dip’ fizzled to almost nothing did I start to think about what I could have spent all that cash on. I had tried so hard to maximize my gains that I was afraid to sell anything—lest my portfolio grow less exponentially than it otherwise would have. \n\nSo many moments in the proceeding bear market where I tormented myself with questions: “why didn’t I at least buy a nice car?” Or “I could have sold enough for a house and still have more in my portfolio than I currently have”, or “Man I could have bought so much ETH now if I had sold back then.” \n\nA lot of regret made me fall out of love with “hodl”.\n\n    4.  The bull market does come to an end.\n\nYes yes—institutions, mainstream, celebrities, El Salvador, PayPal, etc. Blah blah blah.\n\nRemember: the “institutions” make money when the market goes up and they make more money when the market goes down. Governments are corrupt and will pass and nullify laws for their benefit. \n\nThe bull run will absolutely come to an an end—and while no one knows when “THE” bull ends, you can very much know when YOUR bull ends: when you’ve hit your goal.\n\nBrace yourselves, and God Speed.","2":"This is huge. Ethereum just closed the day burning more Ethereum than mined. Just so you know, Ethereum is now one of the few deflationary currencies on the planet.\n\n If this keeps going on, Ethereum will be an even stronger asset than it is currently. It just shows the plans the team had for Ethereum is now paying off. \n\nOnce Ethereum 2.0 is complete god knows how far this can take us. Just the London Upgrade itself spurred a new bull run. Keep your Ethereum safe. Remember: we are still early! \n\nPeople are already expecting 10k Ethereum this year alone. Ethereum turning deflationary is extremely bullish for the price. Especially in the long term.","3":"With recently energy efficiency becoming more important, XLM is even more energy efficent than VISA.\n\n&amp;#x200B;\n\nBitcoin takes 1575.93 kWh per transaction\n\nEthereum takes 107.75 kWh per transaction\n\nEthereum 2.0 will take around 0.53 kWh per transaction (99.5% reduction from Ethereum \/ there will be more improvements in the future)\n\nVisa takes 0.00092 kWh per transaction\n\nXLM takes 0.00022 kWh per transaction\n\n&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/ih0nhnixoll71.png?width=1534&amp;format=png&amp;auto=webp&amp;s=d59587a25f0a5b94a524c8b68da43ae0f8aed2e5\n\n[source](https:\/\/stellar.org\/blog\/diving-into-energy-use-on-stellar-blockchain-payment-efficiency-examined?locale=en)","4":"20 days ago I posted about the golden cross that is currently forming on BTC which was on track to complete by mid-September. After re-analyzing I can confirm it is still on track and should roughly complete in the 3rd week. This is when the 50 day moving average (DMA) will cross above the 200 DMA. The last time this happened was in May 2020 which led to a BTC rallying from $8,000 to $64,800 (+700%). Don't expect a 700% gain again but I can foresee this golden crossover pushing BTC to $80K and perhaps finally to the famous $100K mark everyone has been waiting on for awhile now. I still think we're on track to see $100K BTC in late January to early March 2022 if the golden cross completes in September. \n      \nIn my previous post (20 days ago) I said if you're feeling bullish on this current rally you should not wait to buy BTC, since then the price has already risen 9% (from $45K to $49K). If the golden cross pans out there is still plenty of time to buy now. However, the longer you wait the more you'll pay so again, if you're bullish, pick up some BTC now and enjoy the ride to $100K!","5":"But $100 each week might. I did a poll here about a week ago asking what everyone's portfolio values were. The majority of people (12% of those polled) were in the $1000-$5000 range. For many, this is a huge sum of money. Depending on where you live or your living conditions this could range from a month's pay to a year's, and if you have your entire year's salary invested that's awesome! That being said, unless I miss my guess the majority of the members of this subreddit are from the US, Canada, and UK. \n\nHere's the thing: if you want life changing wealth, whatever that means to you, you need to invest a decent chunk of change. If you threw $100 into the market just to \"see what happens\" it's not going to do much unless you're making some extremely risky plays which may as well be scratch off lottery tickets.\n\nIf you want to build wealth it will take time and money, and a lot of both. Get into the habit of putting a percentage of your paycheck directly into your investments. Crypto, stocks, precious metals, NFTs, whatever, just always be buying, especially when you're starting out. \n\nDCA every day, this is the Gwei.","6":"","7":"Where are we in the current bull market? Not even close to the Peak. 200-300k btc and 20k ETH coming, so hang onto your hats.\n\nThere’s a super interesting and useful article that was posted yesterday. I’ve been here about 7 years now, definitely haven’t made any real gains during that time, but just bided my time and paid attention to long term patterns. I got scammed and lost 20k back in 2015. Basically my entire life savings. Had to start over and dig out of a massive hole. I didn’t give up. I persisted and came back from my lowest point ever in life. Now I’m here and 2021 is the time to get rich! For all of us, friends.\n\nI especially pay attention to Charlie Lee, who sold all his Litecoin at $350. He basically called the last market top to a T. He says we have a LONG way to go in this current bull run. \n\nUsually, we see 15x-16x gains from peak to market peak. We’ve only hit 3x so far in this market cycle. That means we could be looking at 300k Bitcoin in the not too distant future. And 21k ETH.\n\nIf we all follow this, we are going to make some serious coin. No matter when you bought, no matter how much or how little you have, if you wait and sell during the euphoria (blow off top) when there’s a 2x price increase in a 24 hour span, you are destined for massive gains. Then, buy back in a few months later when the market is crashing 80% all the way back to 2T (current levels).\n\nThe article is on cointelegraph and it’s called “How to prepare for the end of the bull run, Part 1: Timing” I’m posting the actual link in the comments below so it doesn’t get deleted. \n\nCurious to hear your thoughts, and this article has me feeling so damn bullish. Good luck friends, may the riches ever be in your favor.","8":"IOTA is up in the 24h change by 24.61% and in 7d change by 92.28%!!!\n\nThat's incredible, people start to realize how undervalued the coin is. It is built for the future and in like 10 years from now on everyone will be using it.\n\nIt is nice to finally see people buying more IOTA and the price rising. Let's see when it will beat its old ATH at $5.\n\nDisclaimer: I'm no financial advisor, I'm not shilling this coin. I do own some IOTA and wish it to rise more in price. Just being so happy to see unexpected green dildos. Do you own research. If you do not want to do your own research let me tell you that: IOTA is pretty nice. Trust me bro.","9":"","10":"","11":"**Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n \n***\n-\n    \n###Disclaimer:\n\nConsider all information posted here with several liberal heaps of salt, and always cross check any information you may read on this thread with known sources. Any trade information posted in this open thread may be highly misleading, and could be an attempt to manipulate new readers by known \"pump and dump (PnD) groups\" for their own profit. BEWARE of such practices and exercise utmost caution before acting on any trade tip mentioned here. \n\n\n**Please be careful about what information you share and the actions you take.** Do not share the amounts of your portfolios (why not just share percentage?). Do not share your private keys or wallet seed. Use strong, non-SMS 2FA if possible. Beware of scammers and be smart. Do not invest more than you can afford to lose, and do not fall for pyramid schemes, promises of unrealistic returns (get-rich-quick schemes), and other common scams.\n    \n***\n-\n    \n###Rules:\n\n  - All [sub rules](https:\/\/www.reddit.com\/r\/CryptoCurrency\/about\/rules\/) apply in this thread. The prior exemption for karma and age requirements is no longer in effect. \n  - Discussion topics must be related to cryptocurrency.\n  - Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n  - Comments will be sorted by newest first.\n  \n***\n-\n\n###Useful Links:\n\n  - [**Beginner Resources**](https:\/\/www.reddit.com\/r\/CryptoCurrency\/wiki\/beginner_resources)\n\n  - [**Intro to r\/Cryptocurrency MOONs 🌔**](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/gj96lb\/introducing_rcryptocurrency_moons\/)\n\n  - [**MOONs Wiki Page**](https:\/\/www.reddit.com\/r\/CryptoCurrency\/wiki\/moons_wiki\/)\n\n  - [**r\/CryptoCurrency Discord**](https:\/\/old.reddit.com\/r\/CryptoCurrency\/comments\/kth255\/join_the_crypto_currency_discord\/)\n\n  - [**r\/CryptoCurrencyMemes**](https:\/\/www.reddit.com\/r\/cryptocurrencymemes)\n\n  - [**Prior Daily Discussions**](https:\/\/old.reddit.com\/r\/CryptoCurrency\/search?q=title%3A\"Daily+Discussion+-+\"+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n  - [**r\/CryptoCurrencyMeta**](https:\/\/www.reddit.com\/r\/CryptoCurrencyMeta\/) - Join in on all meta discussions regarding r\/CryptoCurrency whether it be moon distributions or governance.","12":"Way too much fud in here lately and quite frankly, some people on here are just rude. \n\nNot in this thread! This is good vibes only. \n\nPost your coin and I (Chicky Nuggy - expert in pretty much everything besides skiing) will tell you why it's a great choice and the benefits of owning such a noble coin.\n\nPlease feel free to chime in if you see a coin and you would also like to compliment it too, I'll throw awards and tips out like you're a cheap Ukrainian hooker. (expensive Ukrainian hookers are also available) \n\nLove Chicky Nuggy, CCE (certified crypto expert)","13":"","14":"Been a medium\/long time hodler, watched and regretted never buying in when BTC was at $250… After watching the FOMO for years and buying into it only first in early 2018 Learned as much as I could, constant DCA, emotional ups and downs, you know the drill, I finally cashed out for the first time! \n\nWhat a relief! I only cashed out a small amount to purchase some steel bumpers for my new truck but still… \n\nI’ve always had the feeling that if I cash out I lost potential gains (and losses I guess). But honestly, these new bumpers are now on the way and it’s all from profit…\n\nGonna feel good looking at my truck knowing I finally have something tangible from this wild space and all the time spent over the last few years!\n\nCheers and hope you guys can feel the same when you pull some profits!\n\nEdit: Wow! You guys are awesome! Didn’t think this post would spur such a response and, as a long time lurker here for the most part, glad to see everyone’s mutual love for the game!","15":"For anyone who hasn't seen the front page of the NYTimes today, they were apparently told it's time to spread a little FUD.\n\nhttps:\/\/preview.redd.it\/vm696qhv8pl71.png?width=1440&amp;format=png&amp;auto=webp&amp;s=d8ad3117b41ea1480a8501c188f76d00ee371362\n\nWhich is fine.  Nothing new, right?  But what is surprising is the amount of comments that are negative with a lot of them outright calling for the U.S. government to ban crypto.  My favorite comment is this one, which applauds China for it's use of the ban-hammer.\n\nhttps:\/\/preview.redd.it\/sdxfigt4cpl71.png?width=577&amp;format=png&amp;auto=webp&amp;s=6681c7d294383a35df3554f3b1fc8b3d39f28d1e\n\n**My conclusion has to be that we are still insanely early.  I'm going to keep on DCA-ing.**","16":"As many of you know the golden cross is a MASSIVE bull signal, the last time it happened in may 2020 we saw BTC go from $8,000 to $64,800, 700% gain!\nThis bear cycle we've been in the past few months started with a death cross (oposite of golden cross) in june of 2021. \n\n\n[GOLDEN CROSS](http:\/\/imgur.com\/a\/Hmn7W3W\n\nThe second half of this bull cycle has begun and we're about to see parabolic gains over the next few months. People are gonna keep doubting it until we breach the previous ATH, but I guarantee it's coming. \nCongrats to everybody who held through the dips, yet again it proves to be a winning strategy when it comes to crypto!","17":"It is now the one month anniversary of the introduction of EIP-1559, which introduced fee burning to the Ethereum Network.\n\nIn the past month, 200,000 Ether have been burned for a total value of over 750 Million dollars. \n\nThis is absolutely wild, as when all these coins are burned it reduces the circulating supply which drives the price of ETH higher.\n\nThis makes me even more bullish on ETH. Once ETH shifts to Proof of Stake if fees stay the same, the amount of ETH being produced will be lower than the amount being burned, therefore ETH will become deflationary and the price will increase.\n\nI hope I gave you enough hopium for the day!","18":"","19":"","20":"Its investors can not be that stupid, they are manipulated.\n\nIt is down 20% in 7 days, 83% from all time high, while the whole market is bullish.\n\nIts developers kept failing to launch a simple app for 8 days\n\nIf you take a look at their subreddit you see how extreme it gets:\n\n&gt;People who FUD are Whales who only want to get it cheap\n\nEvery single non bullish post is either deleted\/removed or being downvoted\n\n&gt;Is this your retirement strategy?\n\nIt is a never ending cycle of self-verification in a bubble pushing out everyone who does not take part of it. At this point it is like a cult","21":"Are you fed up with all of the posts asking you for your top 5 alt coins or which coins you think are going to 100x next? Do you have no idea what you are doing but still want to take part in the conversation and farm those sweet, sweet Moons? Are you new to Crypto and are thinking that this sub would give you a coherent opinion on which coins are best for you? Then say no more fam, for I give you my Sunday morning's worth of work.\n\n[The Random Crypto Opinion Generator](https:\/\/perchance.org\/randomcryptoopiniongenerator) [https:\/\/perchance.org\/randomcryptoopiniongenerator](https:\/\/perchance.org\/randomcryptoopiniongenerator)\n\nSimply click on the link and you will be given a random opinion on which coins to purchase. If you don't like that opinion, just hit the randomize button and get another opinion completely free. Be warned though, the Random Crypto Opinion Generator does throw out the occasional hot take so don't treat this as financial advice.\n\nShare your random opinions here and let me know if you want to see your favourite\/most hated coin added to the list.","22":"","23":"#Your weekly dose of Crypto, Aug 29 - Sept 4\n\n1. The total market cap is up by over 8% in the last 7 days and stood at $2.38 trillion. Bitcoin dominance is at 39.7% and Ethereum dominance is at 19.4%.  \n2. ETH has risen by over 20% in the last 7 days amidst NFT resurgence. Now, it’s only 10% down from its ATH. BTC’s one week support and resistance levels stood at $46k and $51k.  \n3. Among the altcoins, Fantom surged by over 120% in the last 7 days, following the announcement of a new 370 million incentive program for builders [link](https:\/\/fantom.foundation\/blog\/announcing-370m-ftm-incentive-program\/).  \n4. SOL has claimed 7th position by market cap and has made a new ATH of $149.91. It’s price has tripled since the launch of Degenerate Ape Academy NFT Project. ADA has made a new ATH $3.09 as the network prepares for the Alonzo hard fork.  \n5. U.S. Department of Treasury wants to incorporate new crypto reporting requirements in an upcoming $3.5 Trillion Reconciliation Bill, according to a report. This would require American exchanges to report information about non-US users, that information could be exchanged with other countries to ensure crypto tax compliance [link](https:\/\/www.rollcall.com\/2021\/08\/30\/treasury-pushes-global-crypto-data-sharing-rules-in-budget-bill\/).  \n6. The amount of ETH burned has surpassed the amount of ETH minted in 24 hours(between Thursday and Friday) for the first time since EIP-1559, which allowed for transaction fees to be burned [link](https:\/\/mobile.twitter.com\/evan_van_ness\/status\/1433935864015564801).  \n7. Uniswap Labs is reportedly under investigation by SEC, which is seeking to obtain information about how investors use the DeFi platform and how it is marketed [link](https:\/\/www.wsj.com\/articles\/regulators-investigate-crypto-exchange-developer-uniswap-labs-11630666800).  \n8. BitConneeeeeeect has been sued by the SEC over its alleged $2 billion scam after three years. SEC is asking the US District Court to order the defendants to return all the money and pay a civil penalty [link](https:\/\/www.sec.gov\/litigation\/complaints\/2021\/comp-pr2021-172.pdf).  \n9. Binance NFT Marketplace in partnership with the State Hermitage Museum (St. Petersburg, Russia) has launched an NFT auction involving the digital reproductions of “The Madonna and Child” by Leonardo da Vinci and  “Lilac Bush” by Vincent Van Gogh among others [link](https:\/\/www.binance.com\/en\/nft\/events\/winterpalace).\n\nPS: Since the post was getting removed by auto mod, I will add the links to the sources in the comments below.\n\nEdit 1: added sources  \nEdit 2: Daily recaps are not allowed anymore, many people started doing this and it kinda got spammy tbh. Therefore, I’ll be doing weekly doses from now on.","24":"We all made mistakes in Crypto, some small, some happy little accidents, and some, not that small nor happy.\n\nBasically; everything works, everything that you regret, this could be finding about BTC on early days and not caring about, or loosing your wallet, selling at dip, etc.\n\n&amp;#x200B;\n\nMine is definitely not buying at the big crash of the May\/July, even if I had FIAT at the moment, I was scared that BTC is about to lose more value...that was a HARD lesson that I learned that day.\n\nOr for the second example is; thinking that BTC is a scam in the 2017 and missing the chance of making 5x, now looking back, I want to beat the shit out my past self...","25":" We’re all tired of hearing life stories, but this story isn’t about my life; it’s about the lives of my students.\n\nA little background: I am a science and technology teacher in a rural part of a developing country. This job is extremely rewarding, but almost equally as frustrating, especially when it comes to budgeting for our students’ education. This hits my classes particularly hard, being that they are technology-focused and require hardware and software that eats away at the school’s budget. When I ask for something as simple as new mice for the computers, it’s often met with a sigh of exasperation from the administration.\n\nNo teacher wants their students to be at a disadvantage just because their classroom doesn’t include the latest gadgets and technology. Paying for supplies and equipment with my own salary was not practical (fellow educators, you know what I’m talking about).\n\nThat’s when I decided to do something. I’ve been taking gains off the top of my own crypto earnings during the March\/April runup and, if the market stops crabbing, I’ll take some more.\n\nThese profits will be used for buying some much-needed equipment to be used in the classroom. Some things that I’ve already been able to procure are electronics\/robotics kits! This is so very exciting, because we have been doing either virtual circuits (thank jeebus for Tinkercad!) or cobbling robots together with literal shoestrings and cardboard (which also has its charms).\n\nHere are the new kits ready for the students when we go back to onsite learning:\n\n[Left: electronics kits with Arduino microcontrollers Right: finished robotic car with ultrasonic sensor \\\/ Arduino and breadboard](https:\/\/preview.redd.it\/yg0xlbnv7pl71.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9b7f570c8cea32879b89f437d06dfd42507cbe0e)\n\nNext on the list are mice\/keyboards, a 3D printer, and hopefully some new GPUs. If Moons moon, I know what we’re getting!\n\nWe return to school in October and I can’t wait to show the students what we’re going to be working with, all thanks to cryptocurrency!\n\nThese kids might not have much, but I hope that I can at least give them the knowledge and experience to go out and be competitive in this world.\n\nAnd before you ask; yes, I do also teach a little about cryptocurrency\/blockchain technology in one of my general computing classes. In addition, we have been using \\[a certain crypto\\] as class rewards and doing activities like virtual marketplaces.","26":"    Preface\n\nOnce upon a long time ago, Sir Issac Newton was sitting under an apple tree and something fell on his head. He looks down and to his surprise, its a metal back up for a seed phrase that Satoshi placed in the tree. So he asked himself, exchange or hardware wallet? Instead of answering this crucial question, he went onto do useless stuff like studying gravity. The question has been left, until today.\n\n&amp;#x200B;\n\n    Intro\n\nHello crypto lovers!\n\nRecently I have seen numerous posts from both CHADS and BRADS regarding where the best place is to store your crypto - many just masquerading good points but are actually shit posts. I decided to take it a step further by masquerading as a shit post but actually doing some research. Below I will discuss both hardware wallets and exchanges. \n\nFor exchanges, I will answer 3 basic questions, these questions will cover, how was security in the past, how is present security, what happens something goes wrong? Here are are the 3 questions:\n\n* Have they been hacked in the past? By hacking, I do not mean individual account getting hacked (due to practices of the individual), but the exchange getting hacked. \n* What do they do to secure your crypto\/account?\n* Do they have insurance? \n\nFor hardware wallets, I will answer 2 basic questions:\n\n* Have they been hacked in the past?\n* How secure are they? (Security features)\n\n***NOTE: This post is for educational purposes, it does not advocate for anything method specifically and if you read till the end you will see why.*** *But 2 points must be stated:*\n\n1. *I have a bias towards hardware wallets (if you read the seed phrase part, you will see why) but I am attempting to speak impartially.*\n2. *If I have made a mistake, please tell me an I will fix it.*\n\nLet's get into it! \n\n&amp;#x200B;\n\n    Analysis of Popular Exchanges\/Brokers\n\n# Coinbase\n\n***Have they been hacked in the past?***\n\n* Coinbase has actually never been hacked in the past! This is great news considering that they have been around since 2012 and is how a public listed company. \n\n***What do they do to secure your crypto\/account?***\n\n* Coinbase states that 98% of the customers funds are stores in offline storages and sensitive data is disconnected entirely from the internet. Data is AES-256 encrypted (unbreakable by brute force by current computing power), then copied to FIPS-140 USB drives and paper backups. These drives and paper backups are then distributed to geographically in safe deposit boxes and vaults around the world.\n* Internal practices - Each employee undergoes a criminal background check, they are required to encrypt their hard drives, utilise strong passwords, and enable screen locking.\n* SQL injection filters are used to prevent CSRF attacks (attacks that force a user to execute unwanted actions on web applications in which they are logged into eg: tricking you into transferring your funds).\n* Encourage use of strong password and 2FA - they allow 2FA through authenticator apps (eg: Google authenticator). Great way to avoid SIM swaps. \n* Whitelisting - This allows the user to designate addresses to an address book. This means that Coinbase can only withdraw funds to designated address books making it difficult for hackers to take funds out in case they get access to your account. Removing addresses or adding addresses requires 2FA. \n\n***Do they have insurance?***\n\n* Coinbase has insurance that protects a *portion of digital assets* held across storage systems in case of theft, especially cyber security breaches. If breaches exceed insurance, total recovery may not be possible.\n* Coinbase has insurance for US customers on fiat - up to $250,000 USD. \n* Insurance policy *does not cover losses resulting from unauthorised access to personal Coinbase account* due to a breach of loss of credentials.\n\n&amp;#x200B;\n\n# Binance.US\n\n***Have they been hacked in the past?***\n\n* In 2019, hackers stole 7000 bitcoin from Binance. The funds represented a small fraction of Binance funds and came out of their hot wallets. Hackers also managed to get user information including 2FA codes. Binance covered incident in full. Check it out here: [https:\/\/www.binance.com\/en\/support\/announcement\/360028031711](https:\/\/www.binance.com\/en\/support\/announcement\/360028031711)\n\n***What do they do to secure your crypto\/account?***\n\n* Ok this was a huge issue, Binance is not transparent at all. I did some major digging and for every other exchange they tell you exactly what their security measures are. I am not alone, here is a post on August 30th 2021 by [Time.com](https:\/\/Time.com) stating the same thing, scroll down to part about security: [https:\/\/time.com\/nextadvisor\/investing\/cryptocurrency\/binance-us-review\/](https:\/\/time.com\/nextadvisor\/investing\/cryptocurrency\/binance-us-review\/)\n* I would urge them to be transparent. \n\n***Do they have insurance?***\n\n* Again, information was incredibly difficult to find from a primary source.\n* [Yahoo.com](https:\/\/Yahoo.com) has stated that their USD deposits are insured according to a blog post published by Binance but this has been taken removed since. Here is a link to the Yahoo post: [https:\/\/finance.yahoo.com\/news\/binance-u-adds-fdic-insurance-180831092.html](https:\/\/finance.yahoo.com\/news\/binance-u-adds-fdic-insurance-180831092.html)\n* Again, I urge transparency. \n\n&amp;#x200B;\n\n# Kraken\n\n***Have they been hacked in the past?***\n\n* Kraken has never been hacked since its launch in 2013 and from multiple sources is considered one of the most secure cryptocurrency exchanges!\n\n***What do they do to secure your crypto\/account?***\n\n* Hired a global team of top security professionals that has experience in building security programs for the world's top brands.\n* 95% of deposits are kept in offline, air-gapped geographically distributed cold storage.\n* They keep FULL reserves so that withdrawals are immediate.\n* Their servers are in secure cages under 24\/7 surveillance by armed guards and video monitors. Physical access and code deployment are strictly controlled. Nothing leaves without intensive review.\n* Sensitive account info is encrypted at both the system and data level.\n* They conduct tests on their own servers by an expert team and has offered the bug bounty program to the community to find broader security issues. \n* 2FA\n* doesn't allow phone\/SMS recover - rules out SIM swaps.\n* Interesting note: Kraken as developed \"Kraken Security Labs\" to test third-party services and products as well as theirs in an effort to help identify and publicise issues before they are exploited. \n\n***Do they have insurance?***\n\n* Kraken states that cryptocurrency exchanges do not quality for deposit insurance because they are not classified as \"saving institutions\". \n* Kraken actually encourages the use of hardware wallets and states that Kraken should not be treated as a wallet.\n\n&amp;#x200B;\n\n# Gemini\n\n***Have they been hacked in the past?***\n\n* Nope! Great job!\n\n***What do they do to secure your crypto\/account?***\n\n* Majority of customer's crypto is held offline in an air-gapped cold storage system. Only a small amount is on the online hot wallet. Note: air-gapped basically means not connected to the internet.\n* Use of HSM (hardware security module) that has achieved a FIPS 14-2 level 3 or higher. You can see what that means here: [https:\/\/en.wikipedia.org\/wiki\/FIPS\\_140-2#Level\\_3](https:\/\/en.wikipedia.org\/wiki\/FIPS_140-2#Level_3)\n* Private keys are generated on the HSMs and stores and managed there for their lifetime.\n* HSMs are geographically distributed and stores in monitored, access-controlled facilities. \n* Use of multisig - eliminates single points of failure and improves resilience against loss or compromised of individual keys.\n* HSMs require coordinated actions of multiple employees to operate.\n* 2FA.\n* VERY INTERESTING: Gemini support the use of hardware security keys via WebAuthn, you can use your USB security keys (ie your hardware wallet) as a two-factor authentication method to signing into your Gemini account. From my research this doesn't mean you have to give them your seed phrase but rather you can use the physical aspect of a hardware wallet (ie holding down the screen or button) as a method of 2FA.\n* Whitelisting of approved addresses.\n* For their cold storage, multiple signatories are required to transfer cryptocurrency out of cold storage system. \n\n***Do they have insurance?***\n\n* Hot wallet insurance.\n* Cold wallet insurance - $200 million coverage, company states that this is the most out of any cryptocurrency exchange in the world. My research hasn't proven otherwise.\n* Option to buy additional insurance. \n\n&amp;#x200B;\n\n# Crypto.com\n\n***Have they been hacked in the past?***\n\n* Could not find evidence of hacking, great job!\n\n***What do they do to secure your account\/crypto?***\n\n* Ongoing training of staff for security and privacy awareness.\n* All transactions are monitored for compliance and a dedicated team is in charge of this process.\n* An impressive 100% of cryptocurrencies are held in offline cold storage.\n* Use of HSM.\n* Use of multisig.\n* Strict controls of access rights to funds in cold and hot wallets - making it difficult for a single actor to withdraw funds.\n* Multi-factor authentication for accounts.\n* Hackers One bounty program to find exploits and bugs.\n\n***Do they have insurance?***\n\n* $30 million USD in cold storage insurance against physical damage or destruction, and third party theft.\n* US residents USD balances in exchange are covered up to $250,000 per FDIC insurance - fiat also cannot be claimed by creditors. \n\n&amp;#x200B;\n\n# Robinhood\n\n***Have they been hacked in the past?***\n\n* Have had hacks in the past but not crypto specific, so I will omit it. \n\n***What do they do to secure your crypto\/account?***\n\n* States that majority of coins are held in cold storage, some held on hot wallets to support day-to-day operations.\n* Strict operational security when managing cryptocurrencies - eg: coin transfers require authorisation of a select group of people. The people who make up this group are rotated for added security. \n* Security team at Robinhood routinely reviews code and infrastructure of their crypto.\n\n***Do they have insurance?***\n\n* Crime insurance that protects a portion of digital assets held against losses from theft and cybersecurity breaches. These do not cover individual user's negligence (similar to Coinbase).\n* US residents USD balances are covered up to $250,000.\n\n&amp;#x200B;\n\n    Analysis of Popular Exchanges\/Brokers - AUSTRALIA &amp; NEW ZEALAND SPECIFIC\n\n# Swyftx \n\n***Have they been hacked in the past?***\n\n* Nope!\n\n***What do they do to secure your crypto\/account?***\n\n* Says they supply a \"robust security framework\" - quite general IMO.\n* Runs 24\/7 customer DD programs to secure identity.\n* Uses JWT tokens.\n* Session expiry - ie it'll log you out after a while.\n* 2FA.\n* Checks for breaches passwords on other websites.\n* Undergoing external penetration testing (testing strength of their security).\n* Implementing a least privilege security model (idea is that it's difficult for one person to withdraw company\/customer funds). \n* Integrated with Auth0 - specialises in cloud platform security to maintain the highest level of password and account safety. \n\n***Do they have insurance?***\n\n* No information. \n\n&amp;#x200B;\n\n# CoinSpot\n\n***Have they been hacked in the past?***\n\n* No evidence of hacking! Good job!\n\n***What do they do to secure your crypto\/account?***\n\n* ISO 27001 certificate - an external audit was undertaken basically checking ALL aspects of security on the exchange and they passed. Very impressive. \n* Vast majority (unspecified) of assets are in highly secure offline locations.\n* 2FA.\n* Session timeouts.\n* Withdrawal restrictions.\n* Hacker One bounty program. \n\n***Do they have insurance?***\n\n* No information on this.\n\n&amp;#x200B;\n\n# Independent Reserve\n\n***Have they been hacked in the past?***\n\n* Nope! Great job!\n\n***What do they do to secure your crypto?***\n\n* Core servers are held in two tier 3 data centres - ensuring 0 data loss should one site have an outage. \n* Fully functional backup for data. \n* All customer data is signed and encrypted multiple times using geographically dispersed keys, spread across four data centres. \n* Vast majority of digital assets are held in cold storage. The cold storage is secured by multi-layer encryption and is stores in physical vaults in geographically diverse locations.\n* Accessing vaults has high physical security requiring biometric authentication of all persons. \n\n***Do they have insurance?***\n\n* You can get insurance on their premium account service, this gives you the ability to insure from $20,000 AUD up to $5million AUD. But you must pay for the service (depending on amount you want to insure).\n* No evidence of insurance outside the premium plan.\n\n&amp;#x200B;\n\n# Easy Crypto (not exchange, a broker\/retailer)\n\n***Have they been hacked in the past?***\n\n* No, but they don't hold funds.\n\n***What do they do to secure your crypto?***\n\n* Has 2FA on the account.\n* No funds are held so understandable that not a huge amount of security in place.\n\n***Do they have insurance?***\n\n* Their trades are guaranteed. They state that there is NEVER a risk of losing funds while using their platform. From the time they receive customer payment, until order is delivered, Easy Crypto fully grantees the safety of funds.\n\n&amp;#x200B;\n\n    Analysis of Hardware Wallets\n\nFor hardware wallets, the focus is similar but the insurance question is removed as individuals can sort out their own insurance. I will focus on the 4 major hardware wallet providers - Ledger, Trezor, ColdCard, KeepKey. \n\n# Ledger\n\n***Have they been hacked in the past?***\n\n* Security flaw discovered in 2018 which basically allowed resellers to update the devices with malicious code and then siphon the private key and drain user's crypto accounts. But this has been fixed. Read about it here:  [https:\/\/krebsonsecurity.com\/2018\/03\/15-year-old-finds-flaw-in-ledger-crypto-wallet\/](https:\/\/krebsonsecurity.com\/2018\/03\/15-year-old-finds-flaw-in-ledger-crypto-wallet\/)\n* In 2020, Ledger fell victim to a cyberattack are malicious software was installed on one of their servers. It became technically impossible to make an assessment of severity of the data breach.\n* The hack was mainly customer personal information from their e-commerce and marketing database.\n* Importantly: NO LEDGER DEVICE WAS HACKED DIRECTLY AS LEDGER DOES NOT HAVE YOUR SEED PHRASE, SO DON'T PANIC IF YOU HOLD A LEDGER DEVICE. But many customers received phishing emails and it is likely some fell victim to these and gave away their seed phrase and as a result got compromised. \n\n***How secure are they?***\n\n* Offline storage.\n* Ledger claims to have the only certified hardware wallet on the market. Ledger's wallets are certified for security by the ANSSI, the French cyber security agency.\n* Ledger wallets integrate a certified chip, designed to withstand sophisticated attacks. \n* Ledger wallets have their own custom OS (BOLOS) to protect against malicious attacks and isolate apps from each other.\n* Security seals on packages to avoid tampering.\n* Root of Trust - Every time a Ledger device performs a critical action at the firmware level (such as updating OS or installing or removing apps) an HSM will send a challenge to the device (a randomly generated number). This is a way of requesting the device to prove its genuineness - the device proves its genuineness by providing the correct signature for the challenge. If the device cannot provide genuineness, then the server blocks the device. You can read more abut it here: [https:\/\/www.ledger.com\/a-closer-look-into-ledger-security-the-root-of-trust](https:\/\/www.ledger.com\/a-closer-look-into-ledger-security-the-root-of-trust)\n* Physical confirmation before transfer of funds.\n* Passphrase security - this is a password added to your 24 word security phrase. This pass phrase protects your assets if your 24-word recover phrase is compromised, so this means that the attacker will need your seed phrase as well as your secret passphrase. \n* Ledger's seed phrase is compatible with BIP-39, so if Ledger ever ceases to exist, then your funds will not be lost.\n* Physical button.\n\n&amp;#x200B;\n\n# Trezor\n\n***Have they been hacked in the past?***\n\n* No confirmed hacks\n* Hacker claimed they have information on Trezor's customers but never confirmed and Trezor believes this to be a false claim.\n* Kraken claims that they used specialised hardware to hack into Trezor devices. The trick allowed an attacker to read critical wallet parameters, including the private key. You can read more about it here: [https:\/\/cointelegraph.com\/news\/trezor-wallets-can-be-hacked-kraken-reveals](https:\/\/cointelegraph.com\/news\/trezor-wallets-can-be-hacked-kraken-reveals)\n* NOTE: on the above point, the attack requires the Trezor device and it must be opened and extremely specialised hardware to do this. Not sure if it has been \"patched\" but no reported cases of this happening.\n\n***How secure are they?***\n\n* Offline storage.\n* The Bip-39 Phrase is never remembered nor stored on the device.\n* Bootloader verifies the firmware signature - firmware runs only if correctly signed by SatoshiLabs. If signature is invalid, bootloader erases device memory. \n* All operations function only if private and public keys are allowed after user authentication via PIN.\n* Passphrase security - this is a password added to your 24 word security phrase. This pass phrase protects your assets if your 24-word recover phrase is compromised, so this means that the attacker will need your seed phrase as well as your secret passphrase. \n* Trezor hardware case is ultrasonically welded, making it difficult to be restored after breakage (ie 3rd party seller cannot tamper with it then sell it off)\n* PIN code protection against brute force - waiting time between attempts on pin code increases by power of two every single time a wrong PIN is entered. \n* Trezor is compatible with BIP-32, 39, and 44 wallets. So if Trezor shuts down, you can still access your funds. Also, all of Trezor's code is public meaning that developers can maintain it and add new functionalities. \n* Physical button.\n* They are transparent on the issues they have faced in the past, you can see them here: [https:\/\/trezor.io\/security\/](https:\/\/trezor.io\/security\/)\n\n&amp;#x200B;\n\n# ColdCard (Bitcoin Only)\n\n***Have they been hacked in the past?***\n\n* No confirmed hacks!\n* They've had an issue regarding a flaw that could trick users into sending Bitcoin on the mainnet when they meant to use its testnet. You can read about it here: [https:\/\/www.coindesk.com\/tech\/2020\/11\/25\/bypass-attack-in-coldcard-bitcoin-wallet-could-trick-users-into-sending-incorrect-funds\/](https:\/\/www.coindesk.com\/tech\/2020\/11\/25\/bypass-attack-in-coldcard-bitcoin-wallet-could-trick-users-into-sending-incorrect-funds\/)\n\n***How secure are they?***\n\n* Offline storage. \n* They are sent to you in a temper evident bag. \n* PIN code as main defence (has a seed phrase too) - without PIN, there are no backdoors, hints or alternative ways to get into cold card.\n* Passphrase security - this is a password added to your 24 word security phrase. This pass phrase protects your assets if your 24-word recover phrase is compromised, so this means that the attacker will need your seed phrase as well as your secret passphrase. \n* Bank-grade SE with partially\/fully closed source firmware - idea is that the attacker cannot exploit system if they have no knowledge of it.\n* Incremental time delays between attempts on PIN&gt;\n* Even after brute force against pin, the SHA-256 along with TRNG offers further protection, the search space is now 2\\^256. \n* Air-gapped. \n* Physical button.\n\n&amp;#x200B;\n\n# KeepKey\n\n***Have they been hacked in the past?***\n\n* No confirmed hackings.\n* Hacker claimed they hacked marketing and website servers but never confirmed.\n* Kraken said they could crack their device (same method as for Tezor) but KeepKey has denied this. \n\n***How secure are they?***\n\n* Offline storage.\n* Pin protection against unauthorised use.\n* Passphrase security - this is a password added to your 24 word security phrase. This pass phrase protects your assets if your 24-word recover phrase is compromised, so this means that the attacker will need your seed phrase as well as your secret passphrase. \n* Number randomisation - the KeepKey wallet randomly shuffles your PIN number from time-to-time to prevent malware from copying your code and using it and gaining access to your digital assets.\n* Physical Button.\n* Seed Phrse. \n\n&amp;#x200B;\n\n    What does ALL this mean for the CHADS and the BRADS?\n\nAs I stated from the start, I have a bias but not choosing sides. But the battle can end here, most popular methods are safe from hacks and malicious actors, your funds regardless are safe but do have some disadvantages and advantages.\n\n# A message to the exchange CHADS\n\nOn face value, it seems that the exchanges win and are safer! This is not exactly true, I analysed popular exchanges but the list not exhaustive, exchange hacks are far more often than you think, there have been 52 known hacking events. You can see the timeline here: [https:\/\/cryptosec.info\/exchange-hacks\/](https:\/\/cryptosec.info\/exchange-hacks\/)\n\nBut you guys are not far from the BRADS as you might thing. Even these popular exchanges, even though they may say outright, probably secure your funds on cold storage and it's safe to assume that they like use services\/devices of the popular hardware wallet providers. For example, Crypto.com states that they are partnered with Ledger. \n\nYou also have to admit that there is still the issue of a central service controlling your funds and more importantly, your withdrawals. When shit hits the fan, some may stop you. Read some articles from the recent dip in May where users from different exchange\/liquidity pools experienced website crashes and removal of withdrawals. \n\n# \n\n# A message to the hardware wallet BRADS\n\nHardware wallets are pretty secure, actually damn secure, but not fool proof. Also, having funds on an exchange doesn't mean you are screwed. Typing in \"not your keys, not your coins\" won't automatically win you an argument - I know some of the OGs who witnesses Mt Gox may say otherwise, but the research shows that many of the biggest exchanges do care about the funds and some even are insured. \n\nI'm on your team, but we have to be practical. \n\n&amp;#x200B;\n\n    Reconciling the CHADS and the BRADS\n\nSo BRADS, CHADS, here we are. It seems that both of your methods are actually quite secure but of course black swan events are always possible (never forget Murphy's Law!)\n\nBut I found a huge issue and a HUGE liability in both exchanges and hardware wallets. It's.............................................................**YOU.** Yes! You! You are the biggest risk to your cryptocurrency loss, all these different security checks and functions won't safe your funds from you. So I offer you from advice. \n\n&amp;#x200B;\n\n# Advice for the exchange CHADS\n\n* Enable 2FA on your account - ideally you want to use 2FA application such as Google authenticator rather than your phone number; this avoids the risk of a SIM swap. \n* Enable whitelisting for addresses.\n* Check for malware on your computer.\n* Never respond to phishing emails - exchanges will never ask you for your password. \n* Check if your email has been compromised, if it has, don't use it - [https:\/\/haveibeenpwned.com\/](https:\/\/haveibeenpwned.com\/)\n* On the email itself, you should have a recovery email and a 2FA for extra security. \n* Do not reuse password - don't use the password for your Miniclip and Runescape account for your exchange account. (Side note: I am currently trimming rune armour at the Grand Exchange for free if anyone is keen). \n* Don't use dodge exchanges to avoid fees or for better returns - if an exchange promises 90% APY on your elonrocketcoin then it's probably not legit. \n* Ideally, have a computer that doesn't run on windows just for your crypto - THIS IS FOR GIGA CHADS ONLY. \n\n&amp;#x200B;\n\n# Advice for hardware wallet BRADS\n\n* Don't give your hardware wallet to anyone (even without PIN, Seed Phrase or Passphrase).\n* When buying a hardware wallet, make sure the anti-tampering seals on the device are there and if possible, buy directly from the official website rather than a third party. Saving $30 from a third party, may not be the best if you end up losing all your funds.\n* Do not hold your seed phrase or PIN or pass phrase digitally or on perishable material such as paper, stamp or engrave it onto metal or use another metal device.\n* !!WARNING: SELF PROMOTION AHEAD!! I have a business that sells 204 grade durable stainless steel plates. They come in a variety of colours and pre-orders are available in October 2021. Check us out at [www.testudo.co.nz](https:\/\/www.testudo.co.nz) or search up TESTUDO crypto on google and it should be the first result. \n* Here is a list of metal back ups and their strength: [https:\/\/jlopp.github.io\/metal-bitcoin-storage-reviews\/](https:\/\/jlopp.github.io\/metal-bitcoin-storage-reviews\/)\n* Do not put your seed phrase next to your hardware wallet device. This is stupid. \n* When sending or receiving crypto, make sure that you check the first 5 letters\/numbers of the address and the last 5 letters\/numbers of the address to ensure that they match with whoever you are receiving from\/sending to. If you see that it's different or changing, you may have clipboard malware. \n\n&amp;#x200B;\n\n# Mini note: For CHADS that want to be BRADS\n\nMany of you that hold your crypto on exchanges want to transfer it to a hardware wallet but too scared to do so. That's fine but understand that it's a very simple process. Do a little bit of crypto so you can get some mental confirmation that it does work! I know that gas fees are a huge on some cryptos, so grab a small amount of a crypto with small transaction fees (NANO or XML for example) and practice with that!\n\n&amp;#x200B;\n\n# Do be a CHAD or a BRAD?\n\nIt's personal choice! You decide what you like to do based on the information provided. I think that if you are just a HODLer, become a hardware wallet BRAD, you can control your funds and keep them secure, but if you are someone who trades, participates in liquidity pools, and move funds a lot then it's probably a better idea to be a CHAD because you can avoid significant transaction fees from moving your funds from a hardware wallet to an exchange and vice versa. \n\nBut if I told you, you could be both? OMG!!! You can hold some of your crypto in the exchange (the ones you want to move around and trade etc) and have your HODL bag in a hardware wallet! \n\nBut in the end, it's up to you and what you prefer. \n\n&amp;#x200B;\n\n# Conclusion\/TLDR\n\nCHADS and BRADS neither of you are correct nor incorrect. The main issue comes to individuals not practicing basic security in regard to their crypto holding medium. Crypto is still a financial wild wild west - you asked for decentralisaition, you got it. Now it is up to you to secure your bag. Remember, insurance on an exchange doesn't mean that you will be safe from everything - they won't cover a single SAT caused by your ignorance. Keep your funds safe guys. Cheers.\n\nAnd of course:\n\nhttps:\/\/i.redd.it\/rnr70zpptml71.gif\n\n&amp;#x200B;\n\n#","27":"Each time a Binance discussion starts its fk them, their shitty customer service, they are scammers, they list whatever shitcoin, etc etc... So here it goes a little love to them.\n\nI got into Binance International 3 years ago and i can still use it in my country, i  also got into BNB back then. I used their launchpool and launchpads and this alone already gave me back like 1\/3 of my initial investment back. They started the ETH 2.0 staking program very fast in December 2020 and i also got in -Then i regret not waiting and get into BETH directly when it was 0.89- but still was really nice getting into it early since rewards have been good. They release good staking oportunities like BTC locked for 3 months at 7% apy...\n\nI never had a problem with their site, i move funds in and out from BSC to farm over there when oportunities are great. I understand that sometimes they have issues going down when usage goes into max capacity as other exchanges suffer the same, i dont trade so i really dont care much about this but i understand that for a trader they must find the best platform to avoid this. Customer service i chatted once for the KYC issue and it was solved, it wasnt very fast but in the end it was solved.\n\nWe all love the money and to generate money, we are all in for it and Binance has been a great Money generator, so i love them for it. Im waiting for them to release their Visa card and then i will be hooked for longggg.","28":"Had a great end of my shift today watching MATIC blast off over $1.70!  I'd be lying if I told you that MATIC hasn't been the most fun project I've invested in.\n\nTo think that MATIC started the year at $0.03 is mind boggling.    Its been a wild ride climbing to $2.80, dipping back to $1.00.  Pumping back up to $2.20, then crashing down to $0.60 during the massive market correction in July.  Now we're busting through the $1.70 resistance and hopefully beyond.\n\n&amp;#x200B;\n\nWhat's your favorite coin that has had insane movement this year?\n\n&amp;#x200B;\n\nThis is not financial advice, DYOR, DCA and HODL.  \n\nand most important of all....................don't be a paper handed b#@&amp;h","29":"","30":"Being a part of this sub over the past few months has made me realize that A LOT of people seem to be investing in crypto for the hopes of acquiring life changing money. “Fuck you” money as others call it. \n\nThat’s all well and good and I wholeheartedly wish that you achieve your dreams. Each and every one of you. I really do. What does concern me however is the amount of people that seem to expect this life changing money to come about in a very short timeline. \n\nCrypto is like nothing I’ve ever experienced before. The highs and lows are insane. That money is out there. 100%. And that is part of the problem. People see coins and tokens doubling, tripling, 5xing in months or even weeks. It still happens. Every day. There is simply no predicting it or making sense of it. \n\nThere is something that you can predict though. As sure as there’s shit in a pup, you know it ain’t gonna be your ass that hits that 5x in 5 weeks. That’s not how it works friend. \n\nSo buckle up, choose your coins, get your popcorn ready and get comfortable on the sidelines as everyone else’s coins moon and you sit there with your 2x. \n\nBut hey, it’s still 2x ya greedy fuck. Be happy. We’ll get there.","31":"# First of all this is not financial advise, these are just trends I tend to see through bitcoin cycles. Also, if you're a long term hodler (10 years minimum), you can simply ignore this post if you want. This post is for people who tend to go in and out of the market every market cycle. Also, probably if you're a long term hodler you would not be on this sub.\n\n&amp;#x200B;\n\nYou rpobably will need this post later, I'd advise you to save it for later. \n\nSo you have been a good investor and navigated your way into the market cycle by DCAing and hodling for quite a while. But what next? will you just keep looking at the charts every 5 minutes till the end of the bullrun? I am here to help you how to navigate your way out of the market cycle.\n\n&amp;#x200B;\n\n\"Time in the market beats timing the markets\" -Abraham Lincoln\n\nYou probably heard this quote multiple times. However, you can try to time the market when it is overly heated so you lock in some nice profits. I mean, who wants to see the value of their coin drop 80% and risk hodling alts in the bear market?\n\n&amp;#x200B;\n\nSo, what are the signs that market cycle is overheated and we're approaching cycle high?\n\n&amp;#x200B;\n\nFirst of all, you need to understand that bitcoin go through [market cycles](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/oxceoe\/i_have_learned_the_long_term_trends_of_the_crypto\/). So what signals you should be looking for that tells you to lock your profit and get out of the market and comeback in later?\n\n&amp;#x200B;\n\n**1- Bitcoin hit 90-97 RSI on the monthly time frame**\n\n&amp;#x200B;\n\n[Bitcoin index and RSI on the monthly timeframe](https:\/\/preview.redd.it\/9m6h97pu1ll71.png?width=1533&amp;format=png&amp;auto=webp&amp;s=72c2cd269e813015c65a729e427e311b324efb31)\n\nThis usually signals that market is overheated and need to cool of for a bit. \n\n&amp;#x200B;\n\n**2- Pi cycle top indicator on bitcoin chart**\n\n&amp;#x200B;\n\n[Pi cycle top](https:\/\/preview.redd.it\/yfrufj8l2ll71.png?width=1520&amp;format=png&amp;auto=webp&amp;s=6b446ccf4e49c4d8f51b7a214442e6ae1894f6a0)\n\nI do not really know how this indicator works but it worked since bitcoin inception. It indicates that the top is in. Note that we can have multiple cycle tops in one market cycle (just like 2013 and 2014). It indicated that the top was at 62k. However I think we still gonna get another top this market cycle. You can find this indicator on TradingView.\n\n&amp;#x200B;\n\n**3-Bitcoin near the upper logarithmic regression band**\n\n&amp;#x200B;\n\n[Bitcoin logarithmic regression band](https:\/\/preview.redd.it\/eg2j1jxq5ll71.png?width=1519&amp;format=png&amp;auto=webp&amp;s=412b5a519bf9f7fa9f1bf942a73bb1900a1fd292)\n\n[This chart](https:\/\/www.blockchaincenter.net\/bitcoin-rainbow-chart\/) is one of my favorite, it basically tells you what to do as the price progress with time. \n\n&amp;#x200B;\n\n4**- Big drop in bitcoin and altcoins then altcoins go parabolic when bitcoin recovers.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Ethereum price action after bitcoin top](https:\/\/preview.redd.it\/w1uykdyf8ll71.png?width=1516&amp;format=png&amp;auto=webp&amp;s=db9661553b7e469e4b2524d48e02df38f813818c)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[ADA price action after bitcoin top](https:\/\/preview.redd.it\/6bpz288k8ll71.png?width=1513&amp;format=png&amp;auto=webp&amp;s=76a78aa5532bb8f14d5dcbb6ed0a6d2bc886339e)\n\n&amp;#x200B;\n\nThis usually indicates that this is a relief rally for bitcoin and a sign to get out of your favorite altcoins. \n\n&amp;#x200B;\n\n5**-Everyone is talking about a super cycle.**\n\nThis is usually a bearish sign, bitcoin have been going non-stop and you hear all your friends talking about, everyone talking about it is a super cycle (spoiler alert, it is not). This is usually when \"retail\" come in to the market and have some profit and before locking in some profit, bitcoin is -50% from its top. Retail remain holding their bags for 4 other years, some alts die in the bear market and never recover. I guess bitcoin veterans here can tell you more about that. This post is to help you not be that guy. \n\n&amp;#x200B;\n\nI know this post may get a lot of hate and moon boys saying to buy and never sell, and their portfolio probably consists of 95% low quality altcoins. Again, people who actually buy and will never sell, mostly invest in bitcoin in a bear market and will sleep on it for a decade or two, they don't even bother about bitcoin cycles and they are probably not on this sub.\n\n&amp;#x200B;\n\nHowever, what do you guys think another signs that indicates the end of a bull market? This post is mainly technical, but I would like to know more of you on how you guys navigate your exit out of the market.","32":"","33":"I see a lot of new people in the daily and a lot of advice been people here who have only been in crypto for a few weeks with a few hundred dollars. I figured I would help share what I have learned from being in the scene since early 2013.\n\n**1. Don’t ever trust unsolicited messages about crypto.** If you get DMed on Reddit, Discord, Twitter, email, or whatever else from a stranger, it’s a scam. Don’t click their links, don’t recover their seed phrase, don’t install their software, don’t take their advice.\n\n**2. Do Your Own Research.** Never make an investment based on one source of information. Not Reddit, not your friend, not a social media influencer, not from a website. You can utilize all of these as part of your research, but always research from multiple sources and seek out opinions for and against your investments for the best assessment. Often times a single source will be biased or under-informed.**\n\n**3. Have a plan.**\nKnow what your goals are and stick to them. If you think BTC will go to $100,000 and if you sell yours then you can pay off your student loans, then set a sell order now for it and let it happen. Don’t watch it go to $115,000 thinking it will go to $200,000 now only to panic sell for $35,000 at the bottom of the next bear market. Remove your emotions and stick to your plan.\n\n**4. Invest for the long-term. Do not play \/ try to time the market.** If you want to gamble with $50 for fun, sure. If you want to make meaningful money and get that financial independence, lambo, whatever, then find something you think will only be better in 5 years and hold it until you reach your goals. If try to buy low and sell high you will statistically do worse.\n\n**5. Dollar Cost Averaging (DCA) works.** Investing a set amount each paycheck helps to stick to your plan, remove emotion, avoid FOMO, and help you to secure a good price.\n\n**6. A hardware wallet is good for reasons you may not think.**\nYes, you can be your own bank. In the age of rug pulls, hack scandals, and more that IS valuable. What you might not consider is that it also creates an additional barrier to prevent panic selling. Several times I have been tempted to sell but the extra effort of needing to get into my hardware wallet and transfer it to an exchange to sell was enough to get me to keep holding.\n\n**7. Price does not matter. Market cap does.** If a coin is only $0.01 that does not make it cheap, if there are 10000000000000000000000 coins in existence. If it went to $1 it would be more money than exists in the world. Measure a coin instead by market cap. (Price * total coins in circulation) if that meme coin got to a $1 it would be worth more than BTC and I wouldn’t count on that happening.\n\n**8. If you are stressed out all the time unable to stop looking at charts, you are over invested.** Your mental health shouldn’t be neglected and the stress won’t help you make money anyway. Only invest what you can afford to lose, or at the very least can hold for years.\n\n**9. Don’t be afraid to take profits.** You don’t have to sell everything, but if you 10x don’t be afraid to get out your initial investment and enjoy a guaranteed win. Bull markets come and go, small wins make holding long term that much easier.","34":"To short Bitcoin or Ethereum, you need to be an extremely experienced trader.\n\nFor the past 10 days, over 60.000 traders have lost about over $200M each day, sometimes even close to a billion.\n\nSome who have traded on extreme leverage (x125) have lost over $6000000 on a single trade shorting Ethereum or Bitcoin.\n\nDo not short assests which hit all time high after all time high. Most people lose money doing this, not win\n\n[source for data](https:\/\/www.bybt.com\/LiquidationData\/?\/)\n[source for data](https:\/\/www.theblockcrypto.com\/linked\/112437\/crypto-short-liquidation-bitcoin-btc-39000)","35":"The NY Times wrote an interesting take on it. Basically accusing other big money from investing huge amounts of money just for the IPO. Soon as it mooned these folks bailed leaving regular folks holding the bag. \n\n\nMany folks in the cryptoverse suspect something rotten in Denmark. They are correct. \n\n\nTo quote the NY Tikes article-\nMiguel Morel, the founder of Arkham Intelligence, a crypto analysis firm that followed the movements of ICP tokens on the blockchain, said that the price action and flaws in the coin offering process suggested “something went wrong.” In an analysis that Arkham first shared with the DealBook newsletter, the firm noted that “a token dropping over 90 percent in the first month after launch is highly unusual for a project of this scale.”\n\n\n\nThe reality is this crypto promised to be coming up with something bigger than Google and Amazon...\nSome say Dominc Williams never intended to deliver.","36":"","37":"I noticed that some people have a feeling that you need a lot of money to invest in crypto. They have the assumption that if you can’t invest hundreds or thousands of dollars, it’s just not worth it. That is not true! It is perfectly fine to invest with whatever amount of money you have available. \n\nThe goal with investing in crypto doesn’t just have to be to become a millionaire of buy a lambo. It is a way to become part of a community. To become involved in technologies that might play huge roles in the world. Even if you are only in it for the money, a goal can also be to go on a nice holiday or buy something you want. \n\nHave your own goals, and don’t be discouraged if you see others investing money that you can’t invest. \n\nAnd always stick to the known rule: invest only what you can afford to lose!","38":"I started into crypto some months ago with a modest investment (around 2 months worth of income), hoping that it would quickly double and that I would reinvest all my gains in my own company, that desperately needed some cash to invest in parts and machines 😃\n\nUnfortunately things went a little bit south, and made me realize it was maybe not the smartest strategy 😂\n\nEven if I'm now up around 45% with around 4 month worth of income invested, I think more and more about investing longer term : DCAing every month into solid coins and be able to stop working in around 10 years with passive income from staking would be great 🙂\n\nWhat about you? Short term x100 or long term passive income?","39":"In just 24 hours, over 69,000 traders were liquidated, for a combined total of $239m. \n\nThe largest individual order was for $5.5m\n\nIt's not the biggest of days, but I will always appreciate watching the shorts get rekt. I think I'm slightly addicted to their failure.\n\nhttps:\/\/www.bybt.com\/LiquidationData\n\n\nBTC - $78m\n\nETH - $50m\n\nXRP - $14m\n\nSOL - $13m\n\nAXS - $9m\n\nADA - $9m\n\nEOS - $5m\n\nFTM - $5m\n\nDOGE - $4m\n\n\nI'll never understand the level of risk people will take on these bets. I'm assuming they just have more money than sense.","40":"Hey, because Mods stated, that \"Daily Dose of Crypto\" should be in daily discussion, I announce \"Weekly Dose Of Crypto\". That is a compromise to \"reduce spam\", have fun!  \n\n\n1. The global market cap of crypto has **risen 9.1%** to 2.28 trillion USD.\n2. After the first half of the week was mostly red, bitcoin saw an **increase** of **3%**, valuing it  at $50,000. Meanwhile ETH is mostly green this week and has seen as **rise** of **19%!** One ETH is now worth $3,880.\n3. The biggest increase in the Top 100 has **FTM** with **118.8%**, meanwhile in the Top 10 it is SOL with **48.4% - ATH**!\n4. Cryptocurrencies are now **officially legal** in Texas, beforehand it was a gray zone.\n5. Trump stated in a interview with Fox News, that he has \"not been a big fan of cryptos\", while market **continues** to **climb**.\n6. LUNA has seen the biggest decrease in value in the Top 100, **dropping** by **13.45%**.\n7. Code in Twitter has been found, that seems like a tutorial of **tipping** people in **bitcoin**.  \n\n\nThat is it for this week, I hope you guys have a great day and see you next week!","41":"Lurking the sub, as I tend to do, and there’s been an influx lately of posts centred around attempts to time the market by swing trading their tokens. \n\nThis ranges from people trying to jump on and off of pumps, converting their crypto to stable coins when they feel a dip is coming and then trying to buy back at the bottom, and leaving one token based on news for another in the hopes that they can consistently ride the correct wave. \n\nThis way of trading isn’t sustainable. \n\nMany of us know the famous saying that **time in the market beats timing the market.**\n\nThis is important, because it means that for most of us, without years of experience, attempting to time sales and buys etc with more wins than losses is tough, and even if you are experienced it’s still difficult - if it was an easy thing to do there would be a lot of rich people. \n\nThere’s nothing wrong with investing your own way - I’m not here to advise - however, as an opinion be mindful that there is a difference between *investing* and *gambling*. Just be aware of that when you’re selling your ADA because MATIC is pumping and you want to be on the pump. \n\nThe bulls are back in town, the opportunities will come, but there’s much to be learned in humbly accepting that timing the market might be beyond you. \n\nTL:DR - Be aware that trying to time the market and constantly selling your tokens (among other things) to chase pumping projects is more gambling than investing. The average investor needs to be mindful of this and should consider the very famous expression *time in the market beats timing the market*.","42":"Our cat, in which we have had for 7 years has a urinary blockage and is headed up to the ER vet to see if we can clear it up, as it can become lethal if nothing is done about it. He has been struggling past few days.\n\nPoint of this post is this…when it comes to priorities, there is no question on what the right thing is to do. Unexpected expenses happen to all of us…and if it happens to you, just do what you have to do and buy the next dip. \n\nThere will always be more opportunities. And I still have all my staked ETH2, so I can live without the alts for a while. Anyways, pray our little guy gets better soon. We can’t have kids- so our fur babies are our 🌎.\n\nEdit: Thank all of you so much for your kind replies. I know there can be some tension in this community, at times, for various reasons…but when it all comes down to something serious- there are a whole lot of genuinely great people in here. I appreciate all of it.","43":"Stock traders are calling for a ''Big'' crash for a while. They mean -20-30% by saying ''Big'' crash. They tell you to stay away from investing or invest only low amounts because of possible upcoming crash. Dude we, as crypto hodlers, have seen more than -60% a few weeks ago lmao. Some of us even experienced with -70% drop last month.\n\nI think we proved that we have the real diamond hands (or balls) by hodling during that time. Those stock market bois are too fragile lmao.\n\nP.s. ETH to the moon !!! 🚀🚀","44":"I'm sure that the government doesnt like the fact that monero can't be traced by anyone cause let's face it the government want their work to have privacy but they dont want the people to keep their privacy. So, i'm sure that the government will try to find some way to ban monero so with that in mind what do you think the future have in store for monero. \n\nMe personally am very bullish on monero and i honestly think that even if the government were to ban it monero would never die cause a few years from now people are going to realize more and more about the importance of privacy. \n\nAnyway its already 1am here so good night ma dudes","45":"","46":"","47":"You know the type... Oceans 11, 12, 13\n\nFast cars, detailed plans, hot chicks, ear pieces, guns, overriding cctv systems, breaking into the impenetrable vault for that sweet sweet fiat and then making their escape to live a life of wealth.\n\nNowadays all you need is a poindexter to IM someone and tell them their wallet needs validated; and even if successful you can track the movements on the blockchain.\n\nAre we gona see James Bond go after Rug Pullers instead of  maniacs with cool mountain lairs\n\nAre we gona see Norton Antivirus put paid to George Clooney and Brad Pitt\n\nAre we gona see Tom Cruise travel the world trying to track down a Tresor Wallet!","48":"The feedback I received after messing up my Achilles and being forced with the reality that I am going to have to sell a large amount of my holdings; has been simply amazing . The positive feedback wishing me well, offering me solid tips on how to take loans on such etc ; has been really a wonderful experience during a rough time . I know this sub can get toxic and I have had a few negative people message me claiming I’m just moon farming etc , but the pain and stress from it all is far not worth selling myself for a few moons earned off karma . The info tips and good wishes was way more beneficial. Special thanks to the one guy in my inbox who was a saint , you know who you are and some people just make you realize how much worse it could have been in life etc . Glad I joined this sub now","49":"Most of us got into crypto to participate in this tech and financial revolution and got really excited in the first days and weeks, researching the concepts, the jargons, the memes and the coins\/tokens.\n\nBut as it happened, we watched this interest slowly convert into a time-consuming and addictive hobby, one that is not healthy and affects negatively other aspects of your life.\n\nI'll try to give you some perspective on how to change that and better your relationship to crypto:\n\n&amp;#x200B;\n\n1. **Avoid being connected to crypto markets all the time**: Most of us are not traders and don't intend to be. We are here for the long gains, but we keep checking charts, news and our favorite coins every hour or minute. **Try to lock a time of the day you will be reading crypto news, engaging with the community, checking charts**. Try to adapt to that and make it a habit, this way it becomes a natural part of your life and a fulfilling hobby. For example, I'm on a break from work, so I have more time at my disposal. So I've separated some time to be updating more on the crypto world and engage with the community, but I still have time to do errands, study, watch movies and have meaningful relationships, and crypto or any other thing doesn't come in the way.\n2. **Exercise and eat well**: a healthy body is key to a heathy mind. In the beginning, it's not easy for a sedentary to become an active person. Do it slowly. It took years for you to be on your actual state, so have in mind that will take some time to adapt to a new routine.\n3. **Don't leave your job or disengage from it**: keep your job and keep engaged to it. Being a work slave is exhausting and we all (most of us) want to retire early and actually enjoy life. But we can find ways to better our lives even within our current reality. It's a good feeling to find someone who is good at their job and they can help you, right? So try to be this person that restores faith in people to others and earn some dirty fiat along the way to fomo in SOL or LUNA. \n4. **Have a strategy**: define what you want from crypto, huge long gains (HODL), short term gains or a mix of both. If you need to constantly check on a coin, make sure you have a reason for it. If you invested on a coin  to forget about it and become rich in 10 years, it makes no sense to obsess about its chart everyday.\n5. **Try to find other ways to spend your time and things to look for**: if you disengage from crypto completely, even for one week, you will feel naturally more detached from it and open to new interests. Try and find one that can be mentally challenging and improve your life and mood.\n\n&amp;#x200B;\n\nMost of us are privileged, specially in perspective to extremely poor people around the world, now and in the past. To be born at this time in history is a privilege on itself, as being testimony to the rise of the Internet and Crypto is something of its own. Don't let this privilege turn into something negative and let crypto be a fulfilling hobby for you, not an obsession.","50":"","51":"","52":"","53":"So I'm relatively new compared to a lot of people on this sub, I first put money into crypto in May. Wonderful timing, I know. I had a long summer watching the charts turn red.\n\nI was procrastinating at my desk and wondering how crypto has changed your life? For better, or worse? Did you have a goal for a return on your initial investment that you've been able to meet? Did you go on a wild shopping spree with your earnings, or reinvest? Or perhaps you've yet to make significant gains? If so, what are your hopes for the future? Maybe you don't have a plan at all?\n\nI'm curious to hear people's stories. Go on, make this hellish shift at work more interesting for me.","54":"So yesterday my bank (global top 10 bank) decided to block my deposits to my exchange saying that \"there have been numerous complaints\" and \"we decided to no longer work with this merchant\", but what they probably wanted to say was \"we don't want money flowing out of our system and into crypto\".\n\nAfter hours of arguing with the bank, escalating my complaint, informing them that I'm free to do what I want with my money (am I though?), I decided to save myself the hassle and energy.\n\nI went to a P2P marketplace and bought my crypto there for cheaper than I'd get by depositing fiat to my exchange account. \n\nIt felt like a moral victory, and a big finger to the banks","55":"","56":"**Who:** Institutions\/ Whales who have sufficient holdings to move the market price\n\n**What\/How:** It's the oldest trick in the book. Institutions who are holding large bags (at a profit) can dump it in the market, instantly lowering the price. To make it more convincing, institutions often also control the media, and can release some fake FUD.\n\nThis is also called \"shaking out the weak hands\". It's present in stock market as well (see this article by the legendary Wyckoff: [https:\/\/financialpost.com\/investing\/the-secret-trading-strategy-from-the-1930s-that-hedge-funders-dont-want-you-to-know-about](https:\/\/financialpost.com\/investing\/the-secret-trading-strategy-from-the-1930s-that-hedge-funders-dont-want-you-to-know-about))\n\n**When:** This can happen any time, but a popular time for institutional shakeout is close to the last Friday of the month where options expire. This has the additional benefit that the institutional option-sellers can collect the maximum premium (where retail call options expire worthless).\n\nInstitutions also don't want to sell at a loss, so shakeout usually happens when most addresses holdings are in profits. \n\n**Why:** Institutions want to take profits, and at the same time send the price lower so that they can buy in lower. Rinse and repeat, it's easy money for the institutions.\n\n# What to do for newcomers:\n\n1) Avoid selling at a loss, if you believe in crypto. Crypto has such promising upwards potential, it is very likely a great mistake to sell at a loss.\n\n2) Hodl tight. Be careful of \"stop losses\" at round numbers, institutions can use it to shake weak hands effectively.\n\n3) DCA, buy the dip to lower your price average. The lower your price average, the safer you are from such shakeouts in the future.","57":"Corona was\/is a dark time for us and alot of us lost people we cared about. So I'm in no way saying corona was a good thing to happen.\n\nCorona lockdown period was really boring. To be stuck in home not being able to do anything.  Since I was free I decided to search for ways to make money and crypto felt awesome. \n\nAs there was nothing available to spend money on, I decided to buy crypto with the money sitting idly in my account. And  it's been an awesome ride.\n\nWhen did you start investing in crypto?","58":"In [my last post](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/ph6z3y\/deeper_dive_into_moons_participation_rounds_1\/) I described how the median user generally gets around 10 karma per distribution snapshot, and that only about half the people from one round participate (receive karma) in the following round.\n\nThis got me wondering if I could determine how many unique users on the sub have participated in all 16 distributions, etc.  It turns out I could, by downloading all 16 finalized snapshots so far, then extracting all the blockchain addresses (vault addresses), then removing duplicates (users who attended more than one distribution).  It turns out that 207 users have participated in all 16 rounds!  There are another 13 people who received karma on the sub for all 16 rounds *but never opened their vault*!  I won't name them, since obviously they probably have their own reasons and don't need random DMs from people asking them questions.\n\nAnyway, here's a histogram of how many users have appeared in 1 or more distribution **and** had an open vault at any point:\n\nhttps:\/\/preview.redd.it\/8aeh764cxpl71.png?width=887&amp;format=png&amp;auto=webp&amp;s=da2bebcbbe0969ccdd869951db39ba8e4feb3b33\n\nAs you can see, less than half of all users have participated in more than 2 distributions (44% of them to be more precise).\n\n**But wait, you say, aren't there like 100K people with vaults?**  These numbers only add up to about 77K! And in fact, according to [testnet.redditspace.com\/tokens](https:\/\/testnet.redditspace.com\/tokens) there are in over 100K MOON token holders.  This was a real mystery to me and caused me to re-do my entire analysis thinking I'd missed something, until I realized those extra \\~30K addresses most likely \"belong\" to people with no open vaults.  if they ever do open them (prior to the 6 month time limit at which point they disappear) then they would get one of those.  But the fact is, there are only 77,583 unique users (commoners, not counting admins or whoever doesn't appear in the distribution lists) who have received any Moons in a vault.  There are almost 200K separate users identified in total in all the finalized Moon snapshots (199,371 to be precise), so that means less than half of the users who ever were offered Moons took them.","59":"I want show the owner of my favorite café the benefits of accepting crypto. At the moment I always pay with a banking app which has rather high fees. I live in Europe and as far as I know there is no lightning network in my country. So what crypto would be ideal to accept in a café? \n\nI think these are the must haves:\n\n\\- low fees  \n\\- fast transactions  \n\\- simple wallet  \n\\- simple to trade to local currency (Since he has to pay rent and salaries. Plus other customers are also willing to switch)\n\n&amp;#x200B;\n\nI'm looking forward to hear your thoughts. Thanks.","60":"Just want to preface this by saying that I'm not struggling with a gambling addiction. I do up a budget for every week and give myself a budget between $20-$50 per week for gambling depending on other responsibilities. I also have a work place pension set up and I own stocks in good companies. \n\nHowever, I just did the math and realized that I've lost just over $1,000 so far this year on gambling - Mostly Sports Betting. This is after a profit of just over $400 last year. \n\nBut the real kicker was when I did the math for if I just put $20-50 a week away into low-cost Index Funds and Crypto-Currencies. Way less time-intensive, way less stressful (sans the odd crash here and there) and I can always hold it for years or even decades. When I gamble and I lose, it's gone. \n\nDon't want to sound like the fun police telling people to quit gambling and put that money into Crypto or to quit smoking and put it into Crypto as everybody is different, but it completely changed my perspective on money. Going to spend the time that I would have spent gambling exercising a bit more now instead.","61":" The Ethereum price is up 908% in the last twelve months, with the new Ethereum 2.0 on the horizon and a craze of NFT projects running on the Ethereum blockchain for the APES and Degenerates to obsess over, [Should I Buy Ethereum in 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum)\n\n**The Scale**\n\nThe price of Ethereum has increased 908% in the last twelve months to trade at today’s price of **$3,865** and a market capitalization of **$453billio**n. This makes ETH the second-largest cryptocurrency by market cap.\n\nEthereum unlike Bitcoin does not have a fixed amount of coins (coin-cap) however has other deflationary measures in place to control circulating supply.\n\n**Summary Statistics**\n\n* **Asset:** Ether (ETH)\n* **Inception of Network:** 30th July 2015\n* **Current Price (USD):** $3,865\n* **Coin Market Cap (USD):** $453billion\n* **Circulating Supply (As of Writing):** 117,394,131 ETH\n* **Current Mining Block Reward:** 2 ETH\n* **Is Fixed Supply (Coin-Cap):** No\n* **Level of Decentralization:** Top 2 hold &gt; 50% hash rate\n\n**About The Project**\n\nEthereum is a blockchain product that can essentially be described as an operating system for the blockchain. Ethereum is primarily used to build decentralised applications (Dapps) the project achieves this by combining the blockchain with a complete Turing programming language.\n\nEthereum is based on the concept of “Smart Contracts”, which essentially means that if certain conditions are met then a certain code can be run on the platform. This differs from its competitor bitcoin where a coin can typically only be ‘spent or unspent’ with only basic ‘smart contract’ functionality.\n\n**ETH Uses**\n\n* Token Systems (Such as NFT’s)\n* Financial Derivitives and Stable-Value Currencies\n* Identity and Reputation Systems\n* Decentralised File Storage (DropBox but cheaper and decentralised)\n* Decentralised Anonymous Organisations\n* Insurance based contracts systems\n* Peer-to-peer gambling protocols\n\n**ICO- Initial Coin offering**\n\nUpon network creation, 72million ETH was created and allocated based on approximately $18million USD that was raised in their ICO sale. Around 83% of ETH were sold to the public at this point in time, with developers (85 individuals) and the Ethereum Foundation maintaining the 17%.\n\n**Ethereum Mining Reward History**\n\nAt creation 72million Ethereum tokens were created. The token includes a key deflationary mechanism to control the rate at which new ETH is issued. The rate of issuance is currently capped at a 16million per year, however, over time this will continue to become smaller as the difficulty and computing power required to mine will increase.\n\nThe block reward for miners who successfully confirms a transaction on the Ethereum blockchain started at 5ETH back in 2015. After several hard-forks increasing the difficulty of mining the block reward now sits at 2ETH.\n\n**Deflationary Mechanism of Ethereum**\n\nOn August 5th 2021 EIP-1559 (London Hard Fork) was released the update will introduce a minimum payment – the base gas fee- for Ethereum transactions, aiming to stabilise transaction fees. Depending on the network congestion, the base fee may adjust by up to 12.5%.\n\nAfter EIP-1559, every Ethereum block burns part of the transaction fees.\n\n**Ethereum Classic Vs Ethereum Vs Ethereum 2.0**\n\n**What is Ethereum Classic?** Ethereum Classic was the original token created back in 2015, however, after a vulnerability that was discovered in 2016 and $60million of ETH was stolen the community produced a hard fork to remove the vulnerability from the code base and essentially created an ETC and ETH fork. Both of which still co-exist today.\n\n**What is Ethereum 2.0?** Ethereum 2.0 is the name given for a series of major updates to the code base which will be implemented in several phases to transition Ethereum from a proof-of-work (PoW) system (similar to how bitcoin works) to a proof-of-Stake (PoS) protocol. Currently, ETH 2.0 is expected to start rolling out sometime in 2022.\n\n**What is the Difference Between Proof of Work and Proof of Stake?** Both systems are consensus mechanisms used to confirm transactions on the blockchain.\n\nProof of work requires significant amounts of energy due to the exponentially increasing computing power required to solve the cryptographic proof to confirm a transaction on the blockchain (**Mining**). Proof of stake requires miners to hold a stake of ETH on the blockchain and use this ‘guarantee’ to secure the network of transactions (**Staking**).\n\nThe difference is that Proof of Stake should over time become a more economical and faster model for confirming transactions on the blockchain.\n\n**Should I Buy Ethereum NFTs**\n\nEthereum NFT’s seem to be the buzzword of the crypto space in 2021, mainly due to the success of a number of NFT projects such as the Bored Ape Yacht Club and others such as Crypto-Kitties.\n\nIn August of 2021, one of the Bored Ape Yacht Club NFT tokens sold for over $12million at an auction at Sotheby’s which seems to validate the demand for Ethereum based products.\n\nEthereum NFTs projects can be purchased using a leading exchange such as [OpenSea.IO](https:\/\/opensea.io\/) and linking your ETH based wallet such as Coinbase Wallet, or MetaMask. However, be aware that there are **Fake NFT’s out there** so be sure you know what you are buying!\n\n**Summary and Closing Statement**\n\nThe crypto space at the moment is highly speculative and people buying should ensure they are investing in projects which are inside their circle of competence to make a judgment on if they are good or poor investments.\n\nI hope you enjoyed my Ethereum Report for beginners, if you're interested in reading the full guide here's the resource: [Should I Buy Ethereum 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum) :)","62":"I don't know for you guys but Link has been pretty quiet these past months. It's doing it's thing slowly but surely and I believe there's more under it's belt. Maybe not now; in the future but LINK in my opinion is going to stay and play among the big ones.  The Chainlink 2.0 whitepaper was written by a team of world-class academic researchers specializing in fields like security, cryptography, distributed systems, game theory, mathematics, and various other computer science related disciplines. The team itself is solid and there is little projects that goes on without adopting imo the **\" The King of Decentralized Oracle Networks \"** (Some of their clients are Celsius, AAVE, Google Cloud; just to name a few).\n\nAs for the price: if you zoom out for the past 6 months, we noticed we've been trading sideways with a higher high topping around the $52 cap. After the crash we recover from a low of $13 to recent trading price of $30 ( a 2x for anyone who bought at the bottom). I believe LINK is to stay and there much coming especially if BTC is on bullish mode which will result in good traction for generally all the ALTs but a booster for solid projects such as LINK. When crypto is booming, new startup and projects will flower and when they do, they imo will adopt the best leaders in their field. LINK being great by providing off-chain data and services  will surely be adopted and benefits from it.","63":"","64":"","65":"I get that we all want crypto to be big. But that's not a good enough reason why it will be. \n\nIf you separate out your desire to become the next millionaire, can you try and give me a balanced reason why crypto will be big?\n\nI'm after people who are keen to play the devil's advocate here too. There are just as many reasons why crypto could fold, some including the policital environment.\n\nIve chosen the scalability flare because I'm talking about how scalable crypto as a whole is.\n\nP. S I should note that I hold crypto, but my reason for investing was not because I see it being the next biggest thing but because others do. Demand and desire drive prices high. A simple example of this is people saying ETH will hit 4k enough that it does.","66":"in [this](https:\/\/www.entrepreneur.com\/article\/383771) article by entrepeneur they list the top 10 worst performing cryptocurrencies in august and this whole list is so hilarious to me because six of the ten are stablecoins.\nThis is what they even wrote in the article:\n”there were also those that provided negative or negligible returns last month. Let’s take a look at the ten worst performing cryptocurrencies in August.”\n\nheres the list without the non-stablecoins:\n\n8. Tether\n7. Busd\n6. Dai\n5. Usdc\n4. TrueUsd \n3. TerraUsd\n\nWhy would they even bother making an article or mentioining 6 stablecoins in the worst performing because they dont move at all is my question.\nDo they have any idea of what they are or do they have an idea behind this i just dont get.\nAlso do they think people expect returns on stablecoins.","67":"If you bought Bitcoin instead of **AirPods** you ‘d have **$10,147** \\- (Original Price: $159 - Release Date: 12\/13\/16)\n\nIf you bought Bitcoin instead of an **Xbox One** you ‘d have **$33,370** \\- (Original Price: $499 - Release Date: 11\/22\/13)\n\nIf you bought Bitcoin instead of a **Wii U** you ‘d have **$1,362,707** \\- (Original Price: $299 - Release Date: 11\/18\/12)\n\nIf you bought Bitcoin instead of a **Nintendo 3DS** you ‘d have **$14,257,110** \\- (Original Price: $249 - Release Date: 3\/27\/11)\n\nIf you bought Bitcoin instead of a **PornHub Premium** you ‘d have **$1,581** \\- (Original Price: $9.99 - Release Date: 1\/1\/15)\n\nIf you bought Bitcoin instead of an **iPad Mini** you ‘d have **$5,444,786 -** (Original Price: $329 - Release Date: 11\/2\/12)\n\nIf you bought Bitcoin instead of the **Toy Story 3 DVD** you ‘d have **$10,949,117** \\- (Original Price: $10.99 - Release Date: 6\/18\/10)\n\nIf you bought Bitcoin instead of the **Yeezy 350s** you ‘d have **$79,388** \\- (Original Price: $399 - Release Date: 6\/27\/15)\n\nit's really not too late - it's just getting started 😉\n\nSource: [https:\/\/bitcoinorshit.com](https:\/\/bitcoinorshit.com\/)","68":"Hey guys !\n\nI am a hobby photographer and ever since NFT came out I was thinking If I could somehow squeeze some money from it but never actually tried it. Do you think I have a shot at selling my photos as NFTs and if so what is the best site to do so ?\n\nI would like to link my social media so you can see my work and tell me if my \"art\" is worth some money and people are actually willing to spend money on it but apparently I cant link it here cause my previous post got removed. I guess it was because of this, anyway if someone is interested to see my portfolio and tell me if its worth anything I can send them my link in DM.\n\n**Feel free to give me some websites which are user friendly and best for stuff like this, I saw some popular guy on IG using one site but apparently it was invite-only.**\n\nif imgur is allowed, [here](https:\/\/imgur.com\/a\/JDOAh1J) is some of my work.\n\nThanks a lot !","69":"","70":"I'll just get straight to the point:\n***\n## 1. Shady DMs and Emails\nIf an alleged Nigerian prince hits you up for a lucrative contract, saying he will double your investments in case you send him a shillion ADA or something, you should be sure that he's a scammer and nothing more.\n***\n## 2. Clipboard Hijackers\nThey live as extensions in your browsers or programs in your laptop. Whenever they detect a crypto address, they grab it and replace it with one of their own. Never visit shady\/old websites to download that nostalgic video game, more often than not the installer file contains malware. Always, listen... **ALWAYS** double-check the recipient's address whenever you're trying to transfer funds. Also do not install weird keyboard apps on your phone, only trusted ones from the Play\/App store.\n***\n## 3. Untrusted Logins\nTurn that 2FA on, it won't hurt. You might also want to change your password once in a while. I prefer to stay clear from SMS 2FA, because most apps can access and read your messages, and any of them could go ham someday. Use 2FA with an authenticator app and store the \"I forgot my keys\" phrases in a safe place.\n***\nHappy investing and be safe, trust nobody for maximum safety in a dangerous world :)","71":"I’ve been in crypto for a pretty short amount of time but I’ve already used it to settle debts between friends, buy weed, and pay a friend for food they were buying. On multiple occasions. Some people think “wow what an idiot spending his Bitcoin on food! That’ll be worth way more in the future and you’ll be sorry!” but that’s just… not how that works. I intended on buying the food or the weed or whatever it is anyway. It makes no difference (over time) whether I buy with fiat or buy with crypto and add that money to my crypto investments next week. Buying weed with crypto actually saves me $6 in atm fees. It’s not like once you spend your crypto you can never get it back again. So where does this mindset come from? I truly don’t get it.","72":"Updating this week numbers, as you know I'm Venezuelan living here.\n\nConsidering the economic situation of the country (yes, that is the REAL monthly minimim wage) around 36 BTC seems ok, that would be around 1,800,000 USD. \n\nLocalBitcoin was king years ago, trading around the equivalent of 5,000,000 USD weekly. But other exchanges like Binance (which is king here in my opinion, it allows P2P trade between Bolivares and BTC), AirTM, Reserve took customers and money from LocalBitcoin.\n\nAverage wage is around 70-80 USD monthly.\n\n* A 5 members family needs around 400 USD monthly to \"live\".\n* One (1) USD is around 4,058,000 Bs. and 4,06 \"new\" Bs.\n* One (1) moon is around 1,000,000 Bs. and 1 \"new\" Bs.\n\nHere you can see how the Venezuelan Central Banks shows the exchange rate in with and without the six zeroes, they will removed definitely the 1st of October. This doesn't have any economic effect, prices and wages will be the same in absolute values (Here . and , are used inverted)\n\n1 USD is 4,058,787.11 Bs. and 4.06 \"new\" Bs.\n\n[https:\/\/imgur.com\/QxZYQNE](https:\/\/imgur.com\/QxZYQNE)\n\nAMA!\n\nSome sources:\n\n[**https:\/\/www.bloomberg.com\/news\/articles\/2021-07-01\/venezuela-to-cut-six-zeroes-off-bolivar-to-simplify-transactions**](https:\/\/www.bloomberg.com\/news\/articles\/2021-07-01\/venezuela-to-cut-six-zeroes-off-bolivar-to-simplify-transactions)\n\n[https:\/\/translate.google.com\/translate?sl=es&amp;tl=en&amp;u=https:\/\/www.descifrado.com\/2021\/04\/13\/ovf-el-460-de-las-remuneraciones-del-sector-privado-se-pagan-en-dolares\/](https:\/\/translate.google.com\/translate?sl=es&amp;tl=en&amp;u=https:\/\/www.descifrado.com\/2021\/04\/13\/ovf-el-460-de-las-remuneraciones-del-sector-privado-se-pagan-en-dolares\/)\n\n[https:\/\/www.caracaschronicles.com\/](https:\/\/www.caracaschronicles.com\/)\n\n[https:\/\/coin.dance\/volume\/localbitcoins\/VES\/BTC](https:\/\/coin.dance\/volume\/localbitcoins\/VES\/BTC)\n\n[https:\/\/localbitcoins.com\/buy-bitcoins-online\/ves\/](https:\/\/localbitcoins.com\/buy-bitcoins-online\/ves\/)\n\n[https:\/\/www.caracaschronicles.com\/2020\/10\/23\/you-need-285-minimum-wages-in-venezuela-to-feed-your-family\/](https:\/\/www.caracaschronicles.com\/2020\/10\/23\/you-need-285-minimum-wages-in-venezuela-to-feed-your-family\/)\n\n[https:\/\/www.bloomberg.com\/features\/2016-venezuela-cafe-con-leche-index\/](https:\/\/www.bloomberg.com\/features\/2016-venezuela-cafe-con-leche-index\/)","73":"First of all, you'll probably learn something.\nSecond, it's fun as hell. \n\nFirst rule still applies though. Never more than you're willing to lose. \n\nNo, I did not make money day trading. I made all the mistakes one expects from a novice trader. I started in 2018, smack down in the start of the bear market. I also got attached to some coins. I made some good trades, some good arbitrage deals (especially with Nano) then blew almost all of it on a single trade (scam coin called PRL). Didn't set up my stop loss orders. All the bad moves.\n\nWould I do it all again? You betcha. I learned so much about the technical side of it. MACD and RSI are things you should know of, even if you don't day trade for a living. And I had so much fun. Chasing those 1% gains on a single trade is a hoot. Sure it's similar to gambling (it's crypto after all) but if you don't have an addictive nature, you'll have a blast.","74":" \n\n# SERIOUS, BEWARE of Increasingly Sophisticated Malware infection attempts\n\n&amp;#x200B;\n\nJust trying to get the word out there. Once a week\n\nIn the past months, malware infection attempts on this site has become increasingly sophisticated. Below is a summary of infection techniques that I have encountered. With the most sophisticated attacks, common sense and **virus scans is no longer sufficient to ensure safety**.\n\n\\*\\*\"latest wallet\"\/\"custom wallet\"\/\"faster miner\"\\*\\*A newbie asks for the latest wallet, or wallet that doesn't have any tx fees, or the latest\/fastest miner, and the attacker posts his in response. This type of attempt Usually gets spotted pretty quickly.\n\n**Copied\/new ANN** The attacker creates a new topic and posts a malware link as the wallet (or a legit one and changes it to a malware one later).\n\n**Replacing links in quotes** The attacker quotes a legitimate post containing a download link written by the real developer (usually the OP or a update post) and changes the link within the quote to a malware link.\n\n**Compromised dev account** The developer account (usually responsible for making the OP) is compromised and a \"mandatory update\" is posted. This usually happens with old\/abandoned coins so the real developer isn't there to notice the rogue update.\n\n**Packed\/FUD executables** In most of the cases above, the malware has little to now detections on virustotal. This is because any script kiddie can pay $30 and have their malware crypted, rendering them fully undetectable.\n\n**Modified source with backdoor** This was recently brought to my attention via a user report. A newbie, under the guise of reviving a coin posted a new client along with source. However, the source was modified to include a backdoor in the IRC bootstrapping mechanism.here is the relevant [source code](https:\/\/github.com\/alerj78\/lucky7coin\/blob\/master\/src\/irc.cpp#L350-364):The code was part of the initial commit, so it would be difficult to notice the addition of the code by casual inspection. **Also, this would likely not show up on any virus scans.**","75":"","76":"Anyone else here tied to a desk + phone for 8 hours a day and hoping for crypto to get them out of it?\n\nBefore I say anything, I am extremely grateful for having a job in this current world situation.  Many people in these times are losing their jobs, homes, lives etc.  So even having a job is a privilege that I do appreciate.\n\nBut at the same time it causes me a lot of stress because I rely on people and companies to deliver services and products which I resell to my clients, so if these distributors let me down then I let my clients down. I've built up friendships and a reputation for having good service.  So when I let these clients down all the time, because of my suppliers letting me down for stupid reasons, it fills me with shame because I am their sales assistant and I take on all the blame for it.\n\nThe amount of times I've said \"Sorry, it's going to get next week now\".  Because of some fuck up.  Just drains me and doesn't make me enjoy my job one bit.\n\nNothing is going to change because I need these suppliers.  I can't avoid their problematic service.  I think eventually I might lose my biggest customers.  In one way, my job feels as risky as crypto right now.  You can only piss off a client so much before they say 'ta ta'.\n\nSo I won't lie.  I've gone pretty much all in on crypto.\n\nIf crypto gets the real world adoption I expect it to, then my entire portfolio could easily do a 20x-50x.  \n\nBut with my limited quantities of crypto I really have to maximise as much as humanly possible, in order to stand a chance at saying goodbye to XXXX who won't return my call and hasn't sorted out an outstanding order for 1 week now risking an important license renewal for my biggest client.  Or XXXX XXXX who fuck up literally every order I place with them and continually ghost my emails.\n\nGoing half in, or even 3\/4 in, will not allow me to say goodbye to desk.\n\nGood luck to all those going all in to say goodbye to their desks :D","77":"**Disclaimer:**   \n**Do your own research! This post is not a suggestion to FOMO into anything.**  \n**Here are some news where** ***I*** **see potential for a big bull run.**  \n\n\n* This Tuesday on 7th Sept, Bitcoin will become legal tender in El Salvador and Adults In El Salvador Get $30 In Bitcoin \n* Sept. 12 Cardano will launch smart contracts \n* If you believe in crypto cycles, usually winter is common for bull runs\n* Twitter will allow its 300 Million active Users to Add Bitcoin and Ethereum Adresses to their Profiles \n* The hashrate of Bitcoin recovered while we got rid of the hashrate dominance of China \n* Ethereum PoS coming at the end of this year or early next year","78":"Is it in general a wise thing to do, to spend your crypto for example with the Coinbase card to pay off living expenses? I just see it as a way to also use your investments, this could not be done with stocks in the same manner. Both get turned into fiat, but with crypto it feels to work easier, because you don't have to first sell them, and then move the money to a bank account etc.\n\nI feel like I should hold onto my crypto by teeth and nail, because of the potential upswing that they can have. Of course if I am completely out of fiat, then I have to cash out some investments, but when things are okay, I don't see it as a good option. Also, I would feel bad for buying dinner or groceries, later knowing that the crypto I spent could have doubled it's worth. That being said, selling some of your investments to create a better balance in your finances can totally be worthwhile.","79":"#**What’s IOTA?**\n\nIOTA is an open-source distributed ledger and cryptocurrency designed for the Internet of things (IoT). It uses a directed acyclic graph to store transactions on its ledger, motivated by a potentially higher scalability over blockchain based distributed ledgers.\n\n#**Why is IOTA rising so rapidly?**\n\nIn the last months IOTA upgraded their mainnet which required everyone to migrate their tokens, including exchanges. Binance and other exchanges disabled deposits and withdrawals during that time.\n\nBinance uses custom Ledger hardware devices and software on their backend. So they had to wait on Ledger to update their software integration. Just recently they were able to resume withdrawals.\n\nSince Binance is roughly ~80% of IOTAs trading volume, coin supply on exchanges went up since nobody was able to withdraw. Simultaneously big short positions built up as well.\n\n#**The Breakout**\n\nThe short squeeze began, millions in short positions rekt as Binance resumes withdrawals after months. People were desperately waiting to withdraw all their IOTAs since they were so fed up with exchanges gatekeeping their coins.\n\nLiquid supply became illiquid really rapidly. Less exchange supply means higher prices.\n\n#**The Technology**\n\nIOTA recently announced, running smart contracts on the current decentralized devnet. This is quite an advancement, but certainly not really the reason for the current outbreak.\n\nI can recommend everyone to check out IOTAs roadmap and goals towards crypto innovation. They are by far the ones that are advancing the most towards solving the limitations of the blockchain and the trilemma between security, scalability and decentralization. Feeless transactions are unarguably the future of DeFi crypto.\n\nIOTA received a lot of hate from the community since they were often too optimistic with ETAs and deadlines in the past. Nonetheless they are advancing with a completely new approach on crypto, with not really many projects to compare to. — I’d say IOTA just reached their normal coin value again, since they had a similar valuation before the -50% market crash caused by Tesla, China bans, Leverage capitulation etc.","80":"Like really I can’t stress this enough… You get insecure that since it’s a bull run you might see red and your losses might be big? Well it doesn’t matter today’s highs will be the future cycles lows, look historically dips in the price don’t matter because in the long run we always see green.\n\nI was one to get scared to invest in bull markets cause of high prices but I promise you ETH at 4K will be seen as a bargain in the next coming years, BTC at 50k will be seen as a “goddamn man why didn’t I invest at that time” \n\nthat’s how the game goes and that’s how it’s been since 2009 and that’s how it’ll continue to go, really if you can save a couple bucks, not go to the club and limit expenses to DCA every week or month your 5-10 year self would wish it could travel to thank you. \n\nYou think “oh man why didn’t I invest in 2020?” Well the people who invested in 2020 think the same about 2017, and the 2017 guys think that of 2013 and so on, that’s how to game goes, love you guys and DCA baby\n\nOf course if your a psycho and you day-trade don’t mind this","81":"A lot of wallets, exchanges, and other services abstract away this fact from you, but from a security perspective it is really important to understand that you do not actually own your ERC-20 tokens.  \n\nERC-20 is simply a defined standard for a smart contract that has a common interface so that it can be plugged and played into other smart contracts and code without any modification.  An ERC-20 contract is very simple, and more or less only contains the following functionality:\n\n* Creates a supply of a token as an integer value when the contract is created and assigns it all to one address to start\n* Keeps track of a mapping of addresses-&gt;balances\n* Allows an address with a positive balance to transfer part of their balance to another address\n* Allows an address to authorize other addresses (or smart contracts) to transfer tokens on their behalf\n\nThere's slightly more to it than that, but honestly not that much.\n\nWhy do you need to know this?  Because you should never assume that your tokens are \"safe\" because they are in your wallet.  You do not actually ever have direct control over your tokens.  If the contract for the ERC-20 token you are using was not implemented according to the standard, it's very easy for things to go wrong.\n\nAlso, if you are using DeFi platforms and exchanges, you more than likely have had to submit transactions to authorize a spend limit on every token you traded.  Sometimes the exchange defaults to an infinite spend limit so you don't have to do it every time you transact.  What you may not realize is that the spend limit gives another address control over your balance of ERC-20 tokens, FOREVER, until it exceeds the spend limit (which won't happen if it's infinite), or you submit another transaction to reduce the spend limit.  If there is ever some kind of vulnerability in the platform you are using, or it was written with some kind of backdoor, someone can go through the smart contract to yoink all of the coins that it has an approved spend limit for, even if they are sitting \"safely\" in your wallet.\n\nThe above is also true when you deposit your tokens into liquidity pools or stake them.  Usually you will get back some kind of pool token in return, which is just another ERC-20 token.  There's a very good chance the smart contract has the ability to pull those tokens away from your address (and is in fact designed to do so).  Be aware that a malicious actor might find a way to exploit the code to pull these pool tokens to their benefit.\n\nIt's also possible for subtle modifications to the ERC-20 contract standard to lead to hidden back doors that might allow for the creator of a token to transfer other peoples' tokens at any point in time.  Do not assume that all ERC-20 tokens are created equal.  The accepted implementations of the standard itself have also changed over time.  To see what the current template looks like, you can at openzeppelin's implementation here:\n\nhttps:\/\/github.com\/OpenZeppelin\/openzeppelin-contracts\/blob\/9b3710465583284b8c4c5d2245749246bb2e0094\/contracts\/token\/ERC20\/ERC20.sol","82":"We know Bitcoin is mined through a proof-of-work consensus mechanisms and mines get issued new coins and there’s a schedule for how many coins they get. We know gold is mined by digging for it into the ground and refining it. Fiat mining is a deep rabbit whole. \n\nIt works through lending. When you go to the bank and ask for a million dollar loan, the bank isn’t taking that million from someone else who deposited money in the bank, the bank is making, or essentially mining new money. If the bank can get you to borrow, they get to make new fiat money. That’s the equivalent of solving a PoW problem. That’s why everyone is in debt. People are in debt and they make money to get into bigger debt. Corporations are in debt, governments are in debt, on all levels. Those who are not in debt are essentially subsidizing those who are. \n\nSo when you buy a house with your mortgage, the bank gets to make money out of thin air and they essentially cut you in on the deal, which is why mortgages are lucrative. \n\nIf fiat was a crypto currency, we would all call it a scammy shitcoin.","83":" it's been a practice for me to save money in bank since high-school.  Got introduced to crypto recently and decided invest in it.\n\nThough I started with doge, I soon realized my mistake and been DCAing ETH and BTC(recently started BTC) and the returns are amazing.\n\nYes there is a risk of losing it all but keeping money stagnant in bank for just 1-3% interest PA, is criminal waste. \n\nI don't put everything in crypto, I do keep some aside in bank. For like emergencies. \n\nThe 500 characters rule. How much of your income do you keep as fiat? Or do you guys keep everything in stable coins?","84":"We all see that there seem to be a countless number of crypto currencies out there (actually 11,619 at the time of my shower) and a lot of them accomplish the same tasks.  My question is: How many coins do we need? Essentially, how many difference major use cases do you think are needed?  This is discounting coins that’re used to by one businesses (like Helium) because then it would be endless.  I’ve outlined my thoughts below.\n\n1. Savings:  This is essentially a store of value to park your money (*cough* BTC *cough*)\n\n2. Money (to pay people): This would be something like Stellar, Tezos, etc.\n\n3. Smart contracts: Let’s go with something like ETH\n\n4. Cross-chain interoperability: This would help bridge the gap between all of these coins (something like DOT or Link)\n\n5. Financial: This would be an ecosystem like Terra that is used for synthetic stocks and other financial assets.  It also has Anchor which provides a good return on the native stable coin. Win-win.\n\n6. Indexing: If we wanted to throw something fun out we could use something like The Graph which is working to provide a sort of ‘search’ function for the crypto verse.\n\n7. Anonymity: For the people that want a ‘leave no trace’ ethic we can have something like Monero\n\nAdd: 8. A stable coin: This is for when you’re moving between these bridges or just want stability for a bit.\n\nAdd: 9. Defi: Loans and what not. Lots cover this, maybe Algo\n\nAdd: 10. Gaming tokens: Can be used in games. ENJ is an example \n\n* An Exchange:  I don’t quite know where this fits but we need a way to get FIAT on and off the system. This is less of a ‘coin’ per say and more of an architecture. \n\nSo I have 7. What functionality am I missing?  This is just a fun thought experiment.","85":"This is a ballsy call but I am positive on it and traders need to have conviction. This week is the last of all unemployment benefits in most of the US. Many people have taken their government money, not paid rent and bought BTC for over 18 months every week. Next week, starting 9\/13 that won’t happen and you will have people that finally have to pay their bills. I think the market is underestimating this phenomenon. BTC sells off to 37k fast, gets\nthe weak hands out and then goes vertical to 118k by Thanksgiving.  Take it to the bank (or don’t bc banks suck!)","86":"","87":"So I’m finally in the green. I was one of those guys who got in towards the middle of the hype back in April, and I continued buying crypto right up until ath. I didn’t sell a penny, and was holding MATIC, ETH, ALGO, and a few others. As the crash happened, I tried to average down by selling and buying with what I already had. It didn’t work well, and I eventually just closed the charts and tried to forget about it. I was down over 60% and I figured I’d just let it sit until something happens. At this point, I was 60\/40 algo to eth. Come august and it was really rising again. My positions haven’t changed other than an addition of moons. Today, I have finally hit the green, and although it might go down a bit, I am pretty bullish on the coming weeks, and am just happy to see that green number above my portfolio for the first time since may.","88":"","89":" Has anyone else found themselves in this situation? I became aware of cryptocurrencies thanks to news talking about massive gains, so I looked into it. As I went down into the rabbit hole that crypto is, blockchain technology and DEFI shocked me. Of course, I'm still in it for the gains, but if a bear market comes I will stay because the tech behind is amazing. It has the potential to disrupt the world and not only on the economic side. Has anyone else found themselves in this situation? Or do people either invest in the tech or just mind the gains?","90":"","91":"Some people only invest 50$, some people have crypto that can buy houses. What’s important is that we are in this **together**.\n\n***You*** investing in it contributes to ***our*** future.\n\nFor some people crypto can buy them a nice car, or a sweet Dubai vacation. But for some people crypto is a means of escaping poverty and the rigged system of 3rd world countries.\n\nThat’s why I am thankful for each and everyone of you that invests, adopts, or even just talks about it to friends and family, because **you** change lives with it.\n\nThe future is bright, and it is ours.","92":"","93":"The best time to invest in Crypto was in 2008. The 2nd best time to invest is right Now. This mantra has always been my main principle.\n\nUnfortunately for me, people that are dear and close to me, have zero awareness or interest on Crypto. I’ve been trying to encourage them but to no avail. \n\nThey mostly attracted to the traditional Fiat investment scheme. Thinks property, stocks, national trust fund, SME, collectables etc...\n\nI’m at the point where I’m too afraid to even raise the opportunity of Crypto during our small talks or gathering. \n\nI blame this to all the online scam that have been on rampage-mode in my country in the last few years. Eventho non of those scam involve directly with Crypto.\n\nIf you guys have any pointers, do share them here. Thanks","94":"","95":"So we have all heard of moons going to mainnet..... \n\n\nMainnet in cryptocurrency provides a reliable and effective way of gauging the success of any emerging blockchain project. Such features act as proof that a blockchain project is being implemented and that the developer’s team is working on making it efficient and better. Mainnet also does affect the prices of cryptocurrencies both in the short term and long term.\n\nSo my question's are what is your long term price prediction after mainnet..\n\nAnd what is your prediction in short term after mainnet..\n\nPeace out and happy moon week everyone....\n\nEdit:As to the questions about when mainnet, knowone really knows exactly when, The endgame is to successfully migrate Moons to Ethereum Mainnet. The devs are first launching a new scaling network that is built on Arbitrum technology. Arbitrum is a Layer 2 crypto platform that provides fast and private scalability services for smart contracts on the Ethereum blockchain.\n\nThe team chose Arbitrum due to the decentralization which it offers. Also, Arbitrum is developer-friendly and has broad ecosystem support, according to the team.","96":"Chances are you hold at least one proof of stake cryptocurrency. According to Investopedia, The Proof of Stake (PoS) concept states that **a person can validate block transactions according to how many coins they hold**. In many proof of stake cryptocurrencies like Tezos, Polkadot and more, there is no supply cap, so there is inflation. By not staking your coins in these protocols, you're essentially losing money to inflation. Whether you hold your crypto on a centralized exchange like Coinbase (which only offers staking for Cosmos, Tezos, and Algorand) or in a hardware wallet like a Ledger or Trezor, you should always stake your crypto, even if there is a supply cap, but it's more important if there's no cap.\nDon't miss out on those compounding gains!","97":"","98":"Coins I'm dca in:\n\nBTC - the old king, that does nothing apart from forking apart.\n\nEth - the new king, BTC killer, POS coming anytime now(by 2050 for sure), for now enjoy 2 for 1 offer - pay only 2 coins to send 3rd one.\n\nAda - promised land ETH killer, can handle whole one transaction per block\n\nSol - goldfinger, who cares that nodes need terabytes of RAM, decentralisation and scalability is so 2020\n\nAlgo - slow and steady win the race, best stable coin of Europe \n\nTezos - has everything successful projects needs, is like a middle child of smart contract coins - no one care about it\n\nLumen - cheap and fast coin, used purely to send between exchanges to save fees when holding real crypto \n\nVet - great project with great investments, perfect to hodl so you can see profit from 0.013 to 0.0135 in 8 years.\n\nDot - strong project with great future, purposely complicated to confuse you to buy it.\n\nErgo - strong team, best POW and getting more popular by an hour, people care about it only because ETH is going POS\n\nAtom - great staking reward, nothing can stop it's army of almost 35k active users across entire IBC","99":"","100":"","101":"","102":"","103":"There is a big shortsqueeze going on that you should not miss out. Oh, and the coin is fee less and worth to be watchlisted anyway…","104":"","105":"","106":"","107":"Ive been looking into exit strategies now,(personal belief that we are going to see this market cycle peak some time December.)\n\nDCA out \/ 5% overall portfolio chunks per week \n\nstarting this Monday (9\/6) every Monday. \n\nThat way, by the time I believe we would hit those wild crypto peaks I’d be for the most part, out. Locking in gains. Playing with house money. \n\n\nMy question here is,\nWould I owe Uncle Sam more by having multiple small incremental sell orders on paper, or would it be long term capital gains tax due to me rolling over the cash into the stock market? \n\nAs I mentioned…\nI plan on rolling over all of my money into the stock market due to the fact that I’m not in need of the cash atm. (Rolling over\/buying high div stocks) all in plans to eventually hop back into the crypto market during a bear cycle.\n\nIma long term believer in the crypto market. Been here, been burned since 2017. Hence the strong belief in having good a exit strategy.","108":"Retired crypto holders &amp; day traders, what do you reply when someone asks \"So what do you do for a living?\"\nAsking for a friend.","109":"","110":"Am I the only one having better sleep quality when the market is dumping than when it is approaching new ATHs?\n\nMy brain is on green candles addiction\n\nShould I visit a doctor?","111":"","112":"","113":"I was a Cardano fan boy, and I probably still am, but I dropped more than half my bag after trying to dive further into developing smart contracts on Cardano. Since all the Plutus Pioneer lectures and exercises are online, and I’m a programmer, I figured I would get a jump on things and skill up. \nThe problem is, the attitude that Charles has, and seemly a lot of the team, is everything I hate about old style software development: measure 5000 times, cut once\n\nAre there smart people involved? Yes! Are there great ideas and innovative thought? Yes! Am I surprised to hear that the testnet is failing? Not at all. Would a major flaw kill Cardano? Maybe, and it might take another 4 years to make a second cut.\n\nReading through the Plutus Pioneer material and messages, there is an overwhelming attitude that if you don’t understand UTXO and Haskell, it’s your own fault, and you should take a few years to study before you continue. “Plutus is a mathematician programmer’s program for mathematics programmers programming mathematics. If you don’t spend as long studying, as we took to build it, fuck you”, is what the opening slide for the Plutus Pioneers program said (I think. It went by kind of fast so I may be paraphrasing. That’s what it felt like it said). The second slide was for a lab where we are supposed to spend 4 years white boarding a Hello World smart contract. They want to make it clear that if they give us a nice shiny new platform, and we write garbage, we should self immolate. It’s like Charles was still trying to incorporate proof-of-work, and decided that developers needed to solve an increasingly more complicated development environment if they wanted to produce a contract on the chain. \n\nPlutus and Cardano, with its weird 1980s views on SDLC and waterfall methodology, may eventually produce some great stuff, but it’s going to take years for some projects to ramp up and release. Meanwhile, start ups will come along and try to go to market quickly, without the proper skills, and there will be a flood of slow and sloppy code, all blamed on Cardano.\nIt’s going to be like back in the 90s when every high school kid was writing Java applets for web sites. They were terribly written, slow, and hated by users, to the point that you never see Java applets on websites anymore.\nMaybe I’m not smart. I’ll totally buy that. I could spend a few years getting a master’s degree in Plutus Alchemy, or I could use an easier platform and solve business needs quickly. Tough choice.","114":"","115":"","116":"People get too carried away sometimes in bull markets vs bear markets. It’s weird because in both markets you have a similar chance of making losses. The only difference is that scam projects flourish in bull markets cause they feed off of the confidence people have.\n\nBe very careful guys. For now you have to do your own research well since a lot of these popular platforms like Binance don’t have any way of catching scams, which kinda confuses me cause there are smaller platforms like ChilliSwap with AIs and algorithms that are capable of detecting scams so idk why they can’t implement the same thing. They got the money, means and resources to do so…","117":"So I'd like to code an algo, but wouldn't want to put my own money it. Is there a way to make a trading bot that uses fake money?","118":"","119":"Hi, I have the paid subscription on Daniel Chart Champions website. But it's too expensive and I would like to save to see it later.\n\nIs there any fast way to do it? \n\nIf you help me I can give you access to my drive later.\n\nThank you","120":"Hello everyone. I'm a noob in this cryto market and so far have only made .12usd profit from BTC which isnt enough. Alot of telegram and discord servers give good signals to premium members and I can't pay for the membership right now. So my question is how do they\/you find coins that are gonna make a gr8 move? Where do I look? I use binance. Kindly help me in this matter. It'll mean alot. Thanks.","121":"","122":"ICXT - Transparent, fair &amp; innovative \n\nTHE ANTI-WHALE crypto\n\nInternational Currency Exchange Token – Here to change the world of International Currency Exchange. We are ICXT, We represent the 99% . \n\nLinks \n\nwww.icx-t.com \n\nTelegram\nICXTOKEN \n\nReddit\nICXT \n\nTwitter\nICXT5 \n\nInstagram \nIcxtoken \n\nWe are ICXT. We represent the 99%.  One of our main missions is to provide stability through our Anti-Whale Technology (AWT). Our uniqueness stems from the fact that any one holder is only able to purchase 1% of the total supply ICXT, along with our up-and-coming revolutionary project that is Project Plutus.\n\nRegards \nKorey ICXT","123":"In a bull market everything is going up, even projects that aren’t really that special. This is because of the increased level of confidence people have, so they start investing left and right.\n\nIn a bear market people are more careful and plan very well, thus making their investments very predictable. I did the same when betting on CoinFantasy. Comparing my bets in a bull market and bear market was very interesting because I ironically made more money off my bets there in the bear market.","124":"","125":"","126":"The Ethereum price is up 908% in the last twelve months, with the new Ethereum 2.0 on the horizon and a craze of NFT projects running on the Ethereum blockchain for the APES and Degenerates to obsess over, [Should I Buy Ethereum in 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum)\n\n**The Scale**\n\nThe price of Ethereum has increased 908% in the last twelve months to trade at today’s price of **$3,865** and a market capitalization of **$453billio**n. This makes ETH the second-largest cryptocurrency by market cap.\n\nEthereum unlike Bitcoin does not have a fixed amount of coins (coin-cap) however has other deflationary measures in place to control circulating supply.\n\n**Summary Statistics**\n\n* **Asset:** Ether (ETH)\n* **Inception of Network:** 30th July 2015\n* **Current Price (USD):** $3,865\n* **Coin Market Cap (USD):** $453billion\n* **Circulating Supply (As of Writing):** 117,394,131 ETH\n* **Current Mining Block Reward:** 2 ETH\n* **Is Fixed Supply (Coin-Cap):** No\n* **Level of Decentralization:** Top 2 hold &gt; 50% hash rate\n\n**About The Project**\n\nEthereum is a blockchain product that can essentially be described as an operating system for the blockchain. Ethereum is primarily used to build decentralised applications (Dapps) the project achieves this by combining the blockchain with a complete Turing programming language.\n\nEthereum is based on the concept of “Smart Contracts”, which essentially means that if certain conditions are met then a certain code can be run on the platform. This differs from its competitor bitcoin where a coin can typically only be ‘spent or unspent’ with only basic ‘smart contract’ functionality.\n\n**ETH Uses**\n\n* Token Systems (Such as NFT’s)\n* Financial Derivitives and Stable-Value Currencies\n* Identity and Reputation Systems\n* Decentralised File Storage (DropBox but cheaper and decentralised)\n* Decentralised Anonymous Organisations\n* Insurance based contracts systems\n* Peer-to-peer gambling protocols\n\n**ICO- Initial Coin offering**\n\nUpon network creation, 72million ETH was created and allocated based on approximately $18million USD that was raised in their ICO sale. Around 83% of ETH were sold to the public at this point in time, with developers (85 individuals) and the Ethereum Foundation maintaining the 17%.\n\n**Ethereum Mining Reward History**\n\nAt creation 72million Ethereum tokens were created. The token includes a key deflationary mechanism to control the rate at which new ETH is issued. The rate of issuance is currently capped at a 16million per year, however, over time this will continue to become smaller as the difficulty and computing power required to mine will increase.\n\nThe block reward for miners who successfully confirms a transaction on the Ethereum blockchain started at 5ETH back in 2015. After several hard-forks increasing the difficulty of mining the block reward now sits at 2ETH.\n\n**Deflationary Mechanism of Ethereum**\n\nOn August 5th 2021 EIP-1559 (London Hard Fork) was released the update will introduce a minimum payment – the base gas fee- for Ethereum transactions, aiming to stabilise transaction fees. Depending on the network congestion, the base fee may adjust by up to 12.5%.\n\nAfter EIP-1559, every Ethereum block burns part of the transaction fees.\n\n**Ethereum Classic Vs Ethereum Vs Ethereum 2.0**\n\n**What is Ethereum Classic?** Ethereum Classic was the original token created back in 2015, however, after a vulnerability that was discovered in 2016 and $60million of ETH was stolen the community produced a hard fork to remove the vulnerability from the code base and essentially created an ETC and ETH fork. Both of which still co-exist today.\n\n**What is Ethereum 2.0?** Ethereum 2.0 is the name given for a series of major updates to the code base which will be implemented in several phases to transition Ethereum from a proof-of-work (PoW) system (similar to how bitcoin works) to a proof-of-Stake (PoS) protocol. Currently, ETH 2.0 is expected to start rolling out sometime in 2022.\n\n**What is the Difference Between Proof of Work and Proof of Stake?** Both systems are consensus mechanisms used to confirm transactions on the blockchain.\n\nProof of work requires significant amounts of energy due to the exponentially increasing computing power required to solve the cryptographic proof to confirm a transaction on the blockchain (**Mining**). Proof of stake requires miners to hold a stake of ETH on the blockchain and use this ‘guarantee’ to secure the network of transactions (**Staking**).\n\nThe difference is that Proof of Stake should over time become a more economical and faster model for confirming transactions on the blockchain.\n\n**Should I Buy Ethereum NFTs**\n\nEthereum NFT’s seem to be the buzzword of the crypto space in 2021, mainly due to the success of a number of NFT projects such as the Bored Ape Yacht Club and others such as Crypto-Kitties.\n\nIn August of 2021, one of the Bored Ape Yacht Club NFT tokens sold for over $12million at an auction at Sotheby’s which seems to validate the demand for Ethereum based products.\n\nEthereum NFTs projects can be purchased using a leading exchange such as [OpenSea.IO](https:\/\/opensea.io\/) and linking your ETH based wallet such as Coinbase Wallet, or MetaMask. However, be aware that there are **Fake NFT’s out there** so be sure you know what you are buying!\n\n**Summary and Closing Statement**\n\nThe crypto space at the moment is highly speculative and people buying should ensure they are investing in projects which are inside their circle of competence to make a judgment on if they are good or poor investments.\n\nI hope you enjoyed my Ethereum Report for beginners, if you're interested in reading the full guide here's the resource: [Should I Buy Ethereum 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum) :)","127":" Welcome to the \/r\/CryptoMarkets Weekly Discussion thread. The thread guidelines are as follows:\n\n\n\n\\*\\*\\*\n\n\n\n  The thread guidelines are as follows:\n\n\n\n\\*  Discussion topics include, but are not limited to, events of the day, technical analysis, and minor questions.  \n\n\\*  Breaking news or other important content should be submitted as a separate post.\n\n\\*  Cryptocurrency discussion not related to trading should be referred to the r\/CryptoCurrency general discussion thread, \\[see here\\]([https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/62teju\/monthly\\_general\\_discussion\\_april\\_01\\_2017\/](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/62teju\/monthly_general_discussion_april_01_2017\/)). \n\n\\*  Follow the golden rule and be excellent to each other. \n\n\n\n\\*\\*\\*\n\n\n\n  Resources and Tools:\n\n\n\n\\* Consider joining one of the r\/CryptoMarkets chat groups, \\[see here\\]([https:\/\/www.reddit.com\/r\/CryptoMarkets\/wiki\/chat](https:\/\/www.reddit.com\/r\/CryptoMarkets\/wiki\/chat)).\n\n\\* If you are using RES, please click the subscribe button below to be notified when new comments are posted.\n\n\\* To view live streaming comments for this thread, \\[click here\\]([https:\/\/reddit-stream.com\/comments\/auto](https:\/\/reddit-stream.com\/comments\/auto)).  Account permissions are required to post comments through [Reddit-Stream.com](https:\/\/Reddit-Stream.com).\n\n\n\n\\*\\*\\*\n\n\n\n  Thank you in advance for your participation. Enjoy!","128":"","129":"","130":"","131":"I’ve got a spare 10k I want to put into cryptos I’ve got a good chunk in Ada already and I’m mainly wondering which could yield most profits, I also do plan on holding long term, thanks.","132":"","133":"","134":"","135":"","136":"","137":"","138":"Better check it out.  Volume  has doubled.  The Korean volume is going nuts.  It's barely 15% of its  ATH so a long way to go up.  I think this is about to have a huge pump.\n\nA lot of coins their devs spent time pumping the price.  But these devs actually worked on the project, and it's a damn good one!","139":"I want to start small for the time being, just putting some money here and there. I was advised to invest in Ethereum and Cardano but I would not mind putting some euros in Doge or Bitcoin Cash. \n\nAny basic advice regarding these cryptos?","140":"","141":" \n\n# General Conclusion\n\nUniswap is an Ethereum-based decentralised exchange (DEX), where people can trade between with ERC-20 tokens entirely onchain using smart contracts. It eliminates order books and is an interesting feature compared to centralised exchanges (CEXs).\n\nThe main innovations from the Uniswap protocol are the development of a user-friendly platform on which traders can easily swap tokens, while at the same time enabling anyone to be a provider of liquidity and earn passive income through transaction fees.\n\n# How does Uniswap Work?\n\nThe Uniswap protocol does things differently to CEX. It allows users to trade ERC-20 tokens without the need for a middleman. As well as helping to reduce fees, this can iron out some thorny issues concerning censorship.\n\n \n\nUniswap is a 100% decentralised and permissionless protocol, operating on the following formula: xy=k (called “constant product”)\n\nIn which:\n\n* x is amount token X;\n* y is amount token Y;\n* k is a constant\n\nUniswap provides an environment for the parties (Liquidity provider, trader, arbitrageurs and developer) to trade and develop.\n\nLiquidity Providers (LPs)  provide liquidity by depositing Erc-20 tokens into the pool and they receive LP token back as a certificate of ownership of a portion of this pool. After a while, they will be paid with the pool's transaction fees.\n\nTraders participating in trading must pay a fee for each transaction. This fee is stored in the pool and paid to the LP.\n\nArbitrageurs align the price difference between the internal market and external markets.\n\n## For example\n\nThe pool created is ETH\/DAI with 10 $ETH and 1000 $DAI. We have:\n\n&gt;x \\* y = k ⇔ 10 \\* 1000 = 10,000. And 1 $ETH = 100 $DAI and 1 $DAI = 0.01 $ETH.\n\n### Case 1: Swap DAI for ETH.\n\nTrader A enters this pool and swaps 500 $DAI + 0.3% fee to exchange it for $ETH.\n\n⇒ y1 = 500 + 1000 = 1500 $DAI.\n\nk is const ⇒ x1 = k \/ y1 = 6.66 $ETH.\n\nThe trader receives x - x1 = 10 - 6.66 = 3.33 $ETH, which is worth 500 $DAI.\n\n⇒ 1 $ETH = 150.15 $DAI, increase 50.15% from the initial price.\n\n**Note**: 0.3% fee will be added back to the pool after swapping and changes the value of k.\n\n### Case 2: Swap ETH for DAI.\n\nTrader B sells 6 $ETH in exchange for $DAI.\n\n⇒ x1 = 10 + 6 = 16.\n\n⇒ y1 = 10,000 \/ 16 = 625.\n\nIt follows that the trader gets y - y1 = 1000 - 625 = 375 $DAI, which is worth 6 $ETH.\n\n⇒ 1 $ETH = 62.5 $DAI, 37.5% decrease from the initial price.\n\n**Note**: If the slippage is too large, Uniswap will issue a warning before you swap to display a notification.\n\n## New Price Each Token\n\nThe price of the token is determined after a change in reserves. This means the current transaction price is the price of the token which is redetermined at the previous transaction.\n\nThe token price in re-calculated. Hence,\n\n&gt;New Price of $X Token = ∆y\/∆x.\n\nIn Case 1: New 1 $ETH = |y1-y| \/ |x1-x| = 500\/3.33 = 150.15 $DAI.\n\n \n\n**TLDR:**\n\nUniswap V3 combines the benefits of a standard AMM with those of an asset-stable AMM, plus other functions that make using capital more efficient. This makes V3 a super flexible protocol that can accommodate a wide variety of assets.\n\nUniswap V3 can change the game on AMM. It also poses many problems for related projects. Of course when the problem is solved, it is the opportunity!","142":" IX Swap is the first ever platform to provide liquidity pools and automated market making functions for the security token (STO) &amp; tokenized stock industry (TSO).  \n\nCheck more details about IXS token sale [here](https:\/\/read.cash\/@Damian.Adams\/ix-swap-is-ready-for-a-full-blown-takeoff-3667f4b3).\n\n[Source: https:\\\/\\\/www.kucoin.com\\\/blog\\\/en\\_US\\\/join-ixs-token-sale-on-kucoin-spotlight](https:\/\/preview.redd.it\/zp1yb75blnl71.png?width=360&amp;format=png&amp;auto=webp&amp;s=f42f6eb84073c90d8494a8c49e5e4fc2f4fcc534)","143":"","144":"Assuming Kraken accept transferring that much in fiat currency.\n\nmost banks in my country (France) are reluctant to deal with founds originating from crypto.","145":"Hello all,\n\nI am unsure whether or not this has its place here, but if I dont try I will never know.\n\nAs we all know, crypto has known quite the popularity these past months. And one thing that has shocked me most is that I have found barely any social media accounts that explain what is crypto, blockchain technology,... So a friend and I have started an instagram account. \n\nWe go through the basics so that anyone can understand what crypto is. So if ever you suffer to explain what you are investing it and why it is interesting, dont hesitate to go through our page to help make people understand how great crypto is.\n\nHere is the link: https:\/\/instagram.com\/crypto.scholar?utm_medium=copy_link\n\nAnd I hope that you will like it. Thank you.","146":"","147":"","148":"","149":"","150":"I need help on how to convert btc to eth without using id for a wallet, I have btc on my trustwallet app but I cannot change it to eth. Please may someone help. I cant use binance or any other platform as that would result in using ID.","151":"","152":"","153":"","154":"","155":"","156":"","157":"","158":"","159":"","160":"","161":"","162":"","163":"Especially people that live in 3rd world countries, most of them can't even afford a meal. Considering this, we're really lucky to have money to invest.","164":"","165":"","166":"","167":"","168":"","169":"","170":"","171":"","172":"","173":"","174":"","175":"","176":"Exchanges now aren’t like in 2014 (Mt Gox), right now most of them have insurances and are safe. \n\n**Most people aren’t capable of keeping their wallet safe, it’s hard and plenty of people have lost huge amounts of money.**\n\n*Some advice for keeping your wallet safe:*\n\n*1. Don’t take a screenshot or write the seed phrase online (notes in your phone etc.), if you have done that. Consider your wallet compromised and move your crypto ASAP.*\n\n*2. Keep your seed phrase somewhere secure and **NEVER EVER GIVE IT TO SOMEONE ELSE**.\n\n\nKeeping your crypto on an exchange if you invest &lt;$1,000 isn’t a bad idea, I would say anything more than that and you should probably move it to a wallet or even buy a ledger. \n\n**Also exchanges give a sweet 5.5% staking rewards for ETH which is nice**\n\nPlease only use reliable exchanges and not some obscure ones. \n\nSome of my favorites:\n\n-\tBinance (not US)\n-\tCoinbase \n-\tKraken\n-\tGemini\n\nAs I said, this is probably an unpopular opinion, so I’m ready to get downvoted hard ;)","177":"","178":"","179":"","180":"","181":"u\/Primary_Ground_3858\n\nu\/leighb06\n\nand there were many others who spammed a lot on this post.\n\n&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/e72s0h4exml71.png?width=680&amp;format=png&amp;auto=webp&amp;s=a3a5625e5af0fd8b356ffb5e264bdfbd201783f4\n\n&amp;#x200B;\n\nhttps:\/\/preview.redd.it\/q8ujxo7ixml71.png?width=693&amp;format=png&amp;auto=webp&amp;s=60307248cbc71f862abd60aef1296ee678ce5083\n\n&amp;#x200B;\n\n[If you closely observe, they are getting upvotes even for posting emojis.](https:\/\/preview.redd.it\/3mektdrjxml71.png?width=588&amp;format=png&amp;auto=webp&amp;s=c804b237ba488a1a40494ef439a7aebd2ea02ac8)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[here they are clearly asking upvotes for upvotes.](https:\/\/preview.redd.it\/w68eoar6zml71.png?width=711&amp;format=png&amp;auto=webp&amp;s=86b9a9cee8bc0b16b527dec6947ba5874b8dfe12)\n\nthese comments were made on [this](https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi160k\/fly_high_donuts_fly_high\/) post.\n\nThere are many others who spammed here too.","182":"","183":"","184":"Not a damn thing! I’ve watched a lot of people post how much ETH they currently hold and it just motivates me more to add on to mine. I only have .22 but soon I’ll have a full one. Keep strong family and I’ll hope to soon be apart of the 1 ETH division 😁👍🏾💪🏾💪🏾🤙🏾\n\n\nThank you so much for the love and positive responses from you all!!","185":"","186":"","187":"","188":" The Ethereum price is up 908% in the last twelve months, with the new Ethereum 2.0 on the horizon and a craze of NFT projects running on the Ethereum blockchain for the APES and Degenerates to obsess over, [Should I Buy Ethereum in 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum)\n\n**The Scale**\n\nThe price of Ethereum has increased 908% in the last twelve months to trade at today’s price of **$3,865** and a market capitalization of **$453billio**n. This makes ETH the second-largest cryptocurrency by market cap.\n\nEthereum unlike Bitcoin does not have a fixed amount of coins (coin-cap) however has other deflationary measures in place to control circulating supply.\n\n**Summary Statistics**\n\n* **Asset:** Ether (ETH)\n* **Inception of Network:** 30th July 2015\n* **Current Price (USD):** $3,865\n* **Coin Market Cap (USD):** $453billion\n* **Circulating Supply (As of Writing):** 117,394,131 ETH\n* **Current Mining Block Reward:** 2 ETH\n* **Is Fixed Supply (Coin-Cap):** No\n* **Level of Decentralization:** Top 2 hold &gt; 50% hash rate\n\n**About The Project**\n\nEthereum is a blockchain product that can essentially be described as an operating system for the blockchain. Ethereum is primarily used to build decentralised applications (Dapps) the project achieves this by combining the blockchain with a complete Turing programming language.\n\nEthereum is based on the concept of “Smart Contracts”, which essentially means that if certain conditions are met then a certain code can be run on the platform. This differs from its competitor bitcoin where a coin can typically only be ‘spent or unspent’ with only basic ‘smart contract’ functionality.\n\n**ETH Uses**\n\n* Token Systems (Such as NFT’s)\n* Financial Derivitives and Stable-Value Currencies\n* Identity and Reputation Systems\n* Decentralised File Storage (DropBox but cheaper and decentralised)\n* Decentralised Anonymous Organisations\n* Insurance based contracts systems\n* Peer-to-peer gambling protocols\n\n**ICO- Initial Coin offering**\n\nUpon network creation, 72million ETH was created and allocated based on approximately $18million USD that was raised in their ICO sale. Around 83% of ETH were sold to the public at this point in time, with developers (85 individuals) and the Ethereum Foundation maintaining the 17%.\n\n**Ethereum Mining Reward History**\n\nAt creation 72million Ethereum tokens were created. The token includes a key deflationary mechanism to control the rate at which new ETH is issued. The rate of issuance is currently capped at a 16million per year, however, over time this will continue to become smaller as the difficulty and computing power required to mine will increase.\n\nThe block reward for miners who successfully confirms a transaction on the Ethereum blockchain started at 5ETH back in 2015. After several hard-forks increasing the difficulty of mining the block reward now sits at 2ETH.\n\n**Deflationary Mechanism of Ethereum**\n\nOn August 5th 2021 EIP-1559 (London Hard Fork) was released the update will introduce a minimum payment – the base gas fee- for Ethereum transactions, aiming to stabilise transaction fees. Depending on the network congestion, the base fee may adjust by up to 12.5%.\n\nAfter EIP-1559, every Ethereum block burns part of the transaction fees.\n\n**Ethereum Classic Vs Ethereum Vs Ethereum 2.0**\n\n**What is Ethereum Classic?** Ethereum Classic was the original token created back in 2015, however, after a vulnerability that was discovered in 2016 and $60million of ETH was stolen the community produced a hard fork to remove the vulnerability from the code base and essentially created an ETC and ETH fork. Both of which still co-exist today.\n\n**What is Ethereum 2.0?** Ethereum 2.0 is the name given for a series of major updates to the code base which will be implemented in several phases to transition Ethereum from a proof-of-work (PoW) system (similar to how bitcoin works) to a proof-of-Stake (PoS) protocol. Currently, ETH 2.0 is expected to start rolling out sometime in 2022.\n\n**What is the Difference Between Proof of Work and Proof of Stake?** Both systems are consensus mechanisms used to confirm transactions on the blockchain.\n\nProof of work requires significant amounts of energy due to the exponentially increasing computing power required to solve the cryptographic proof to confirm a transaction on the blockchain (**Mining**). Proof of stake requires miners to hold a stake of ETH on the blockchain and use this ‘guarantee’ to secure the network of transactions (**Staking**).\n\nThe difference is that Proof of Stake should over time become a more economical and faster model for confirming transactions on the blockchain.\n\n**Should I Buy Ethereum NFTs**\n\nEthereum NFT’s seem to be the buzzword of the crypto space in 2021, mainly due to the success of a number of NFT projects such as the Bored Ape Yacht Club and others such as Crypto-Kitties.\n\nIn August of 2021, one of the Bored Ape Yacht Club NFT tokens sold for over $12million at an auction at Sotheby’s which seems to validate the demand for Ethereum based products.\n\nEthereum NFTs projects can be purchased using a leading exchange such as [OpenSea.IO](https:\/\/opensea.io\/) and linking your ETH based wallet such as Coinbase Wallet, or MetaMask. However, be aware that there are **Fake NFT’s out there** so be sure you know what you are buying!\n\n**Summary and Closing Statement**\n\nThe crypto space at the moment is highly speculative and people buying should ensure they are investing in projects which are inside their circle of competence to make a judgment on if they are good or poor investments.\n\nI hope you enjoyed my Ethereum Report for beginners, if you're interested in reading the full guide here's the resource: [Should I Buy Ethereum 2021?](https:\/\/prophet-invest.com\/should-i-buy-ethereum) :)","189":"","190":"","191":"**Who:** Institutions\/ Whales who have sufficient holdings to move the market price\n\n**What\/How:** It's the oldest trick in the book. Institutions who are holding large bags (at a profit) can dump it in the market, instantly lowering the price. To make it more convincing, institutions often also control the media, and can release some fake FUD.\n\nThis is also called \"shaking out the weak hands\". It's present in stock market as well (see this article by the legendary Wyckoff: [https:\/\/financialpost.com\/investing\/the-secret-trading-strategy-from-the-1930s-that-hedge-funders-dont-want-you-to-know-about](https:\/\/financialpost.com\/investing\/the-secret-trading-strategy-from-the-1930s-that-hedge-funders-dont-want-you-to-know-about))\n\n**When:** This can happen any time, but a popular time for institutional shakeout is close to the last Friday of the month where options expire. This has the additional benefit that the institutional option-sellers can collect the maximum premium (where retail call options expire worthless).\n\nInstitutions also don't want to sell at a loss, so shakeout usually happens when most addresses holdings are in profits.\n\n**Why:** Institutions want to take profits, and at the same time send the price lower so that they can buy in lower. Rinse and repeat, it's easy money for the institutions.\n\n# What to do for newcomers:\n\n1. Avoid selling at a loss, if you believe in ETH. ETH has such promising upwards potential, it is very likely a great mistake to sell at a loss.\n2. Hodl tight. Be careful of \"stop losses\" at round numbers, institutions can use it to shake weak hands effectively.\n3. DCA, buy the dip to lower your price average. The lower your price average, the safer you are from such shakeouts in the future.","192":"","193":"","194":"","195":"","196":"","197":"\nhttps:\/\/cryptonews.net\/1695199\/?utm_source=CryptoNews&amp;utm_medium=app&amp;utm_campaign=shared","198":"\n**DON’T** visit r\/CryptoMoonShots.\n\n**DON’T** answer to any random DMs on Reddit.\n\n**DON’T** tell anyone how much crypto you have. Not even your family.\n\n**DON’T** buy at FOMO and sell at FUD, instead DCA your way up.\n\n**DON’T** buy shitcoins with words like \"safe\" or \"elon\".\n\n**DON’T** take a screenshot of your seed phrase, instead write it down and store it safely.\n\n**DON’T** use RobbingHood for crypto.\n\n**DON’T** avoid paying taxes.\n\n**DON’T** take financial advice from anyone else and always DYOR.","199":"","200":"","201":"Source: [https:\/\/ethereum.org\/en\/eth2\/shard-chains\/](https:\/\/ethereum.org\/en\/eth2\/shard-chains\/) (Official ETH website)\n\n&gt;Sharding will eventually let you run Ethereum on a personal laptop or phone. So more people should be able to participate, or run [clients](https:\/\/ethereum.org\/en\/developers\/docs\/nodes-and-clients\/), in a sharded Ethereum. This will increase security because the more decentralized the network, the smaller the attack surface area.\n\nThis is very bullish as it means greater network participation. We want more people to be able to participate in validating the network.\n\nNot naming names, but some of the ETH-killers require specialized equipment to run validator nodes, even a mid-range computer won't make the cut. This does allow more \"transactions per second\", but is not good for decentralization.","202":"","203":"","204":"","205":"","206":"","207":"","208":"","209":"","210":"","211":"","212":"","213":"","214":"","215":"","216":"","217":"","218":"Hi guys,I would love to hear some of your insights on the fact there is any correction going to occur any time soon? Before we hit over 4k? Friendly thoughts please. Much appreciated","219":"","220":"","221":"","222":"","223":"","224":"","225":"","226":"\n**I see so many posts \/ comments of people panicking about the dip.**\n\nIf you are a good day trader then you’ll still manage to earn money during a dip. \n\nMost of us are not good and it just causes us to lose money and get stressed, instead I advise everyone to hodl and don’t watch the charts everyday and after a few months you can check your portfolio and be pleasantly surprised instead of being stressed out everyday.\n\nIn the end after a few years you won’t care if that your portfolio dropped 30% on 13 May 2021, but instead you will be happy that your portfolio grew a few hundred %.\n\nOf course it is natural to feel sad when you see your money going down, so I advise all of you to stop checking your portfolio everyday. It would surely help your mental health a lot.\n\n**I know we have been pumping nicely now, but even if we do dip soon, just enjoy the journey!**","227":"Exactly what the title says.\n\nI also need to register to redeem them. Do the expire and are there any fees involved?","228":"","229":"","230":"","231":"","232":" \n\n# General Conclusion\n\nUniswap is an Ethereum-based decentralised exchange (DEX), where people can trade between with ERC-20 tokens entirely onchain using smart contracts. It eliminates order books and is an interesting feature compared to centralised exchanges (CEXs).\n\nThe main innovations from the Uniswap protocol are the development of a user-friendly platform on which traders can easily swap tokens, while at the same time enabling anyone to be a provider of liquidity and earn passive income through transaction fees.\n\n# How does Uniswap Work?\n\nThe Uniswap protocol does things differently to CEX. It allows users to trade ERC-20 tokens without the need for a middleman. As well as helping to reduce fees, this can iron out some thorny issues concerning censorship.\n\n \n\nUniswap is a 100% decentralised and permissionless protocol, operating on the following formula: xy=k (called “constant product”)\n\nIn which:\n\n* x is amount token X;\n* y is amount token Y;\n* k is a constant\n\nUniswap provides an environment for the parties (Liquidity provider, trader, arbitrageurs and developer) to trade and develop.\n\nLiquidity Providers (LPs)  provide liquidity by depositing Erc-20 tokens into the pool and they receive LP token back as a certificate of ownership of a portion of this pool. After a while, they will be paid with the pool's transaction fees.\n\nTraders participating in trading must pay a fee for each transaction. This fee is stored in the pool and paid to the LP.\n\nArbitrageurs align the price difference between the internal market and external markets.\n\n## For example\n\nThe pool created is ETH\/DAI with 10 $ETH and 1000 $DAI. We have:\n\n&gt;x \\* y = k ⇔ 10 \\* 1000 = 10,000. And 1 $ETH = 100 $DAI and 1 $DAI = 0.01 $ETH.\n\n### Case 1: Swap DAI for ETH.\n\nTrader A enters this pool and swaps 500 $DAI + 0.3% fee to exchange it for $ETH.\n\n⇒ y1 = 500 + 1000 = 1500 $DAI.\n\nk is const ⇒ x1 = k \/ y1 = 6.66 $ETH.\n\nThe trader receives x - x1 = 10 - 6.66 = 3.33 $ETH, which is worth 500 $DAI.\n\n⇒ 1 $ETH = 150.15 $DAI, increase 50.15% from the initial price.\n\n**Note**: 0.3% fee will be added back to the pool after swapping and changes the value of k.\n\n### Case 2: Swap ETH for DAI.\n\nTrader B sells 6 $ETH in exchange for $DAI.\n\n⇒ x1 = 10 + 6 = 16.\n\n⇒ y1 = 10,000 \/ 16 = 625.\n\nIt follows that the trader gets y - y1 = 1000 - 625 = 375 $DAI, which is worth 6 $ETH.\n\n⇒ 1 $ETH = 62.5 $DAI, 37.5% decrease from the initial price.\n\n**Note**: If the slippage is too large, Uniswap will issue a warning before you swap to display a notification.\n\n## New Price Each Token\n\nThe price of the token is determined after a change in reserves. This means the current transaction price is the price of the token which is redetermined at the previous transaction.\n\nThe token price in re-calculated. Hence,\n\n&gt;New Price of $X Token = ∆y\/∆x.\n\nIn Case 1: New 1 $ETH = |y1-y| \/ |x1-x| = 500\/3.33 = 150.15 $DAI.\n\n \n\n**TLDR:**\n\nUniswap V3 combines the benefits of a standard AMM with those of an asset-stable AMM, plus other functions that make using capital more efficient. This makes V3 a super flexible protocol that can accommodate a wide variety of assets.\n\nUniswap V3 can change the game on AMM. It also poses many problems for related projects. Of course when the problem is solved, it is the opportunity!","233":"","234":"","235":"","236":"","237":"","238":"","239":"**I bought 10 random cryptos that were advertised on r\/CryptoMoonShots**\n\nThey were advertised as risk free, totally legit (lol) \n\nIn total I had made $108 from my $20 ($2 each) investment but I couldn’t sell as they were all rug pulled. \n\n**Never** buy anything that’s posted on r\/CryptoMoonShots\n\n **THIS IS FINANCIAL ADVICE**\n\nStay safe y’all!","240":"","241":"","242":"","243":"\nhttps:\/\/cryptonews.net\/1694663\/?utm_source=CryptoNews&amp;utm_medium=app&amp;utm_campaign=shared","244":"","245":"","246":"Is it some big whale\/investors\/fund which put an order size so big that it filled the order book and create this spike?","247":"","248":"","249":"","250":"","251":"Its a nice sunny Sunday afternoon and I want hear some jokes!\n\nComment your best **crypto-related** jokes and I’ll give a rating of 1-10.\n\nMy favorite joke is- **If a hot girl messages you about crypto, ignore HIM**\n\nAlso another of **my favorite joke is me trying to trade crypto and thinking I can time the market**\n\nI’m not sure if this is against the rules, if it is please delete this post mods, I don’t think this is tho.","252":"","253":"\n\n• it gets your coins off exchanges meaning you’d be 100% in control of your coins. Not your keys, not your cheese. If your crypto is on an exchange, you don’t own any crypto; the exchange does. You own an IOU from the exchange that promises to give you your crypto when you withdraw. If they get hacked, there’s not much they can do to return your coins. It also means that people can’t short your coins (bet that the price will go down, which puts selling pressure on the coin).\n\n• your private keys (seed phrase) remain 100% offline at all times. You’ll never have to enter your keys into a device connected to the internet. If your phone\/laptop gets hacked and you are using a hot wallet like Trust wallet, it’s possible that they could access your private key and steal your crypto.\n\nIf you are wondering whether it’s worth it to get one? Ask yourself how much of your crypto are you willing to lose to hackers? The answer is probably zero and in that case, it’s best to get a hardware wallet, otherwise known as a cold wallet.","254":"","255":"The how to claim donuts FAQ directs you to a page where all you need to do is comment to claim on xdai sidechain. However it's archived so impossible. Am I missing something?\n\nEdit: \\[Solved\\]","256":"**Thread topics include, but are not limited to:**\n\n* General discussion related to the day's events\n* Technical analysis, trading ideas &amp; strategies\n* Quick questions that do not warrant a separate post\n\n**Thread guidelines:**\n\n* **Be excellent to each other.**\n* Do not make posts outside of the daily thread for the topics mentioned above.\n\n**Other ways to interact:**\n\n[Get an invite](https:\/\/reddit-bitcoinmarkets.slack.com\/join\/shared_invite\/enQtNjM1NTg3ODgwODUzLWRhOGI3MGFlZDVjMzBlYWYwYzIzZWNlOThjZDQ3ZjhlZGU2MDY2ZGY5ZDZjYzY5MzQyYWJiZWE5YzRiNmY0NmM) to live chat on [our Slack group](https:\/\/reddit-bitcoinmarkets.slack.com\/)"},"url":{"0":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pia31k\/no_leaving_your_crypto_on_an_exchange_is_not_the\/","1":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phxrxy\/brace_yourselves_in_the_coming_weeks_crypto\/","2":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi532z\/ethereum_just_had_its_first_ever_deflationary_day\/","3":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi5a7w\/stellar_xlm_consumes_less_energy_per_transaction\/","4":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi62vm\/the_bitcoin_golden_cross_is_still_on_track_to\/","5":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi3w2f\/your_100_investment_wont_make_you_rich\/","6":"https:\/\/companiesmarketcap.com\/assets-by-market-cap\/","7":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/piep4p\/were_now_at_the_floor_market_cap_2t_of_the_next\/","8":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phyr41\/iota_is_up_92_compared_to_last_week_now_at_193\/","9":"https:\/\/oicanadian.com\/sec-refuses-to-produce-documents-related-to-employees-xrp-bitcoin-ethereum-holdings\/","10":"https:\/\/www.publish0x.com\/coins-in-focus\/stellar-in-focus-the-traders-way-to-avoid-fees-xooqgrn","11":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi2iwp\/daily_discussion_september_5_2021_gmt0\/","12":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi28y5\/post_a_coin_and_i_will_tell_you_why_its_a_smart\/","13":"https:\/\/btcpeers.com\/77-of-russian-investors-prefer-bitcoin-to-gold-survey-reveals\/","14":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi0hj8\/cashed_out_for_the_first_time\/","15":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pieqom\/proof_that_anyone_buying_now_is_still_insanely\/","16":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pifvaj\/the_golden_cross_is_inevitable_within_days\/","17":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phzahf\/750_million_dollars_worth_of_eth_have_been_burned\/","18":"https:\/\/www.msn.com\/en-us\/news\/technology\/nsa-doesnt-think-quantum-computers-can-break-public-key-encryption\/ar-AAO4Egk","19":"https:\/\/decrypt.co\/80232\/cryptopunks-zombie-sells-for-3-9m","20":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi2q1f\/safemoons_is_down_20_in_7_days_80_from_all_time\/","21":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi9y10\/finally_an_end_to_the_requests_for_your_top\/","22":"https:\/\/markets.businessinsider.com\/news\/currencies\/locked-crypto-wallet-password-recovery-cryptocurrency-chris-charlie-brooks-btc-2021-9?utm_medium=social&amp;utm_campaign=sf-bi-money&amp;utm_source=facebook.com&amp;fbclid=iwar2qqxkmk2tgrsgeal_0rinn71wbwms7z88fgkuoqvyslxhwqjwcxs2ddzu","23":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/piccnf\/your_weekly_dose_of_crypto\/","24":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pid83b\/question_what_was_your_biggest_regret_on_crypto\/","25":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pieju2\/crypto_is_providing_supplies_for_my_students\/","26":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi86yc\/how_to_store_your_crypto_securely_a_comprehensive\/","27":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi07do\/unpopular_opinion_i_love_binance\/","28":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi4l1n\/all_aboard_the_matic_train_we_just_kicked_in_the\/","29":"https:\/\/bitcoinist.com\/survey-shows-1-in-10-u-s-investors-own-crypto-despite-seeing-it-as-a-risky-asset\/","30":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi4d5a\/if_you_got_into_crypto_to_acquire_life_changing\/","31":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi41y8\/you_hear_about_dca_and_hodl_but_you_never_heard\/","32":"https:\/\/nieuws.btcdirect.eu\/antwerpen-brussel-bitcoin\/","33":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi86j9\/9_lessons_from_a_crypto_veteran\/","34":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pibs6n\/for_your_own_safety_do_not_short_bitcoin_or\/","35":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi228m\/do_people_still_not_understand_icp_is_a_scam_coin\/","36":"https:\/\/cryptocrunchapp.com\/news\/over-1billion-stacked-into-iota-with-25-price-spike-in-24hours\/","37":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picctg\/you_dont_need_a_lot_money_to_invest_in_crypto\/","38":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pifprv\/what_is_your_goal_in_crypto\/","39":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phziss\/in_just_24_hours_over_69000_traders_were\/","40":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi92zm\/your_weekly_dose_of_crypto_week_1\/","41":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi8wgl\/timing_the_market_is_difficult_unless_youre\/","42":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pig7wx\/just_had_to_cash_out_a_bit\/","43":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phzvfw\/do_you_also_find_it_funny_that_all_stock_traders\/","44":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phymg6\/monero\/","45":"https:\/\/coinquora.com\/sundaeswap-clears-misconceptions-amid-recent-cardano-controversy\/","46":"\/r\/Bitcoin\/comments\/phm3bt\/if_people_start_using_their_brain_on_fixing_base\/","47":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pieiur\/will_crypto_be_the_death_of_big_budget_heist\/","48":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi2vyt\/this_sub_can_be_amazing_at_times\/","49":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picqg7\/crypto_is_a_hobby_for_you_and_shouldnt_dominate\/","50":"https:\/\/cryptopotato.com\/ebay-now-allows-the-sale-of-nfts-on-its-platform\/","51":"https:\/\/p2pfoundation.ning.com\/m\/discussion?id=2003008%3ATopic%3A9402#","52":"https:\/\/www.theblockcrypto.com\/linked\/116692\/sen-elizabeth-warren-says-crypto-is-the-new-shadow-bank","53":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pifnvo\/lets_say_you_10x_your_holdings_whats_your_plan\/","54":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phz4fn\/banks_fighting_back\/","55":"https:\/\/unrollthread.com\/t\/1434518391465943048\/","56":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi7ilp\/newcomers_hodl_tight_institutions_may_try_to\/","57":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pidl36\/the_good_thing_about_the_whole_corona_was_that_me\/","58":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pihdyx\/only_207_people_have_participated_in_16_rounds_of\/","59":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/piapfo\/what_crypto_is_ideal_to_accept_in_a_café\/","60":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pia7nd\/took_me_way_too_long_in_life_to_realize_how_much\/","61":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picoel\/ethereum_beginner_basics\/","62":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi89ia\/bullish_on_link_the_silent_hawk\/","63":"https:\/\/www.benzinga.com\/node\/22803217","64":"https:\/\/www.express.co.uk\/finance\/city\/1485551\/Ethereum-price-news-latest-bitcoin-price-crypto-bull-run-dollar-depreciation","65":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi0xco\/why_do_you_actually_think_crypto_will_be_big_take\/","66":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pih5se\/biggest_joke_of_the_day_is_the_ten_worst\/","67":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi5zv7\/bitcoin_or_stupid_shit\/","68":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pifj81\/do_i_have_a_shot_at_selling_nfts_as_a_photographer\/","69":"https:\/\/finance.yahoo.com\/news\/tether-hack-us-3-1-123800540.html","70":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi9qfh\/3_main_threats_to_your_funds_in_the_crypto\/","71":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi1hg7\/i_dont_understand_why_people_are_hesitant_to_use\/","72":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pie2mr\/36_btc_were_traded_last_week_in_venezuela_only\/","73":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi9lp4\/while_most_people_dont_suggest_day_trading_i_say\/","74":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi1y6k\/dont_tell_me_i_didint_warn_you_serious_beware_of\/","75":"https:\/\/www.investing.com\/news\/cryptocurrency-news\/77-of-russian-investors-prefer-bitcoin-to-gold-survey-reveals-2608111","76":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi3ee5\/8_hours_a_day_tied_to_a_desk_all_in_on_crypto_bosh\/","77":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi3bzx\/big_potential_for_a_bull_run\/","78":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picu5u\/is_it_wise_to_pay_for_living_expenses_with_your\/","79":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pib839\/the_truth_about_iota_rising_90\/","80":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi8k7m\/dca_is_key_if_you_are_in_the_long_run\/","81":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pidvss\/ysk_erc20_tokens_are_just_a_balance_tied_to_your\/","82":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picmk9\/ever_thought_about_how_fiat_is_mined\/","83":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pic7bq\/for_me_investing_in_crypto_is_more_profitable\/","84":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi6791\/shower_thought_how_many_coins_do_we_need\/","85":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi5uvo\/the_final_major_btc_sell_off_next_week_between\/","86":"https:\/\/cryptopotato.com\/bitcoin-price-to-hit-100000-by-end-of-2021-chainalysis-ceo\/","87":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pihl8p\/finally_in_the_green_been_nearly_4_months\/","88":"https:\/\/news.bitcoin.com\/bitcoin-market-dominance-dips-down-to-40-while-ethereum-and-other-crypto-market-caps-swell\/","89":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/picsgy\/came_for_the_money_stayed_for_the_tech\/","90":"https:\/\/www.zdnet.com\/article\/microsoft-warns-over-this-unusual-malware-that-targets-windows-and-linux\/","91":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pidugp\/no_matter_your_budget_you_support_our_future_and\/","92":"https:\/\/citytelegraph.com\/blockchain\/5477\/deloittes-annual-blockchain-study-the-fiat-currency-will-be-gone-within-5-to-10-years\/","93":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi6vgl\/how_do_guys_get_others_around_you_to_invest_into\/","94":"https:\/\/news.bitcoin.com\/cheap-power-brings-bitcoin-mining-boom-to-venezuela-as-country-moves-toward-digital-economy\/","95":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/phxqxm\/moons_after_mainnet\/","96":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pigsah\/youre_losing_money_by_not_staking_pos\/","97":"https:\/\/www.yahoo.com\/finance\/news\/father-son-help-clients-forgotten-121500289.html","98":"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/pi9txd\/here_is_a_list_of_my_coins_i_dca_and_why_what_are\/","99":"https:\/\/libyareview.com\/15500\/libya-ranked-1st-among-arab-countries-in-bitcoin-mining\/","100":"https:\/\/i.redd.it\/noo9jzi56ol71.png","101":"https:\/\/www.bitcoininsider.org\/article\/125173\/heres-why-telos-may-be-better-dapp-development-solution-ethereum","102":"https:\/\/i.redd.it\/hrhbmgxuswx61.jpg","103":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/phzpva\/what_you_guys_havent_discussed_iota_yet\/","104":"https:\/\/www.investopedia.com\/bitcoin-briefly-crosses-usd50-000-milestone-5198476","105":"https:\/\/zycrypto.com\/bnpl-pay-the-launch-of-a-revolutionary-defi-lending-in-the-blockchain-space\/","106":"https:\/\/dailyhodl.com\/2021\/09\/04\/cryptocurrencies-gain-legal-status-in-texas-as-new-laws-take-effect\/","107":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pibuqb\/crypto_market_exit_strategy\/","108":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi1rjz\/so_what_do_you_do_for_a_living\/","109":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pi9u3h\/top_5_free_cryptohopper_apps_for_every_user_2021\/?utm_source=ifttt","110":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi3s32\/bull_markets_bad_for_sleep_quality\/","111":"https:\/\/www.thecomprehensivepost.com\/2021\/09\/will-dogecoin-ever-reach-one-dollar.html","112":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pid3gz\/guide_to_invest_in_cryptocurrency_from_india_2021\/?utm_source=ifttt","113":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/phy275\/plutus_pioneer_made_me_dump_ada\/","114":"https:\/\/everycoinprice.com\/?symbol=MIOTA&amp;interval=1week&amp;exchange=0","115":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pi9u3x\/staking_at_binance_is_it_safe_to_stake_on_binance\/?utm_source=ifttt","116":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/phzhdj\/the_one_bad_thing_about_bull_runs_is_that_people\/","117":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/piapp3\/is_there_a_way_to_make_an_algorithm_that_trades\/","118":"https:\/\/techyno.com\/gold-bond-portfolios-are-naked\/","119":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi8byb\/how_to_download_char_champions_videos\/","120":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/phzupz\/how_to_find_good_coins_to_invest_in\/","121":"https:\/\/blog.coincodecap.com\/crypto-investing-guide?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=crypto-investing-guide","122":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pibh00\/join_the_antiwhale_revolution\/","123":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi1r5i\/is_it_just_me_or_do_you_also_think_predicting\/","124":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/piicl1\/published_on_youtube_cryptopunks_zombie_sells_for\/?utm_source=ifttt","125":"https:\/\/blog.coincodecap.com\/okex-review?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=okex-review","126":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/picrbc\/ethereum_beginner_basics\/","127":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pico4f\/weekly_discussion_megathread_september_5_2021_gmt0\/","128":"https:\/\/blog.coincodecap.com\/staking-at-binance?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=staking-at-binance","129":"https:\/\/blog.coincodecap.com\/cryptohopper-apps?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=cryptohopper-apps","130":"https:\/\/www.cityam.com\/bitcoin-super-cycle-stalls-but-hash-rate-is-full-of-promise\/","131":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi3ar9\/10k_in_eth_or_btc\/","132":"https:\/\/i.redd.it\/ky8oddhkqol71.jpg","133":"\/r\/CRYPTOBULLRISE\/comments\/pihzrs\/burn_and_buyback_today_almost_50_burn_thank_you\/","134":"https:\/\/www.youtube.com\/watch?v=gfheZErU7XQ","135":"https:\/\/blog.coincodecap.com\/buy-shiba-wazirx?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=buy-shiba-wazirx","136":"https:\/\/i.redd.it\/j2go1op9vpl71.png","137":"https:\/\/simplecryptoguide.com\/","138":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/piftsp\/qtum_is_in_play\/","139":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pifb0c\/some_advice_for_a_beginner\/","140":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pid3g3\/okex_review_2021_is_it_legit_or_a_scam\/?utm_source=ifttt","141":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pibwk0\/7_changes_in_uniswap_v3_and_lp_impacts\/","142":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi9zqv\/14th_kucoin_spotlight_introducing_ix_swap_worlds\/","143":"https:\/\/sundaeswap-finance.medium.com\/concurrency-state-cardano-c160f8c07575","144":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/piiov1\/which_bank_would_accept_receiving_the_equivalent\/","145":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/piey7z\/instagram_account_to_explain_what_is_crypto_as\/","146":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pi3esp\/binance_vs_coinbase_which_is_the_best_2021\/?utm_source=ifttt","147":"https:\/\/blog.coincodecap.com\/hodlnaut-review?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=hodlnaut-review","148":"https:\/\/blog.coincodecap.com\/binance-vs-coinbase?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=binance-vs-coinbase","149":"https:\/\/blog.coincodecap.com\/buy-shiba-coindcx?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=buy-shiba-coindcx","150":"https:\/\/www.reddit.com\/r\/CryptoMarkets\/comments\/pi5a4k\/i_need_help_on_how_to_swap_btc_to_eth_without_id\/","151":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pihfff\/how_to_buy_shiba_shib_coin_on_wazirx_2021\/?utm_source=ifttt","152":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pihfgd\/how_to_buy_shiba_shib_coin_on_coindcx_2021\/?utm_source=ifttt","153":"https:\/\/youtu.be\/uvB-6VKD5wo","154":"https:\/\/www.reddit.com\/r\/coincodecap\/comments\/pi3etk\/hodlnaut_review_2021_earn_interest_on_your\/?utm_source=ifttt","155":"https:\/\/cryptoglobalpress.blogspot.com\/2021\/09\/elon-musk-backs-dogecoin-upgrade.html","156":"https:\/\/i.redd.it\/dflkfyyc2ol71.jpg","157":"https:\/\/i.redd.it\/nw3kwnjoijl71.jpg","158":"https:\/\/i.redd.it\/yod7tc5m0kl71.jpg","159":"https:\/\/i.redd.it\/6lkj32iq2nl71.png","160":"https:\/\/v.redd.it\/7osask73eol71","161":"https:\/\/i.redd.it\/pa43zmgtrol71.png","162":"https:\/\/i.redd.it\/ydmh2ihimpl71.jpg","163":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi13b6\/ya_ever_try_and_just_take_a_moment_to_appreciate\/","164":"https:\/\/i.redd.it\/pb687es76nl71.jpg","165":"https:\/\/i.redd.it\/mnp89gubbpl71.png","166":"https:\/\/i.redd.it\/fizrwp0eapl71.png","167":"https:\/\/v.redd.it\/oe4tg8u39nl71","168":"https:\/\/i.redd.it\/9scj6qpfjnl71.jpg","169":"https:\/\/i.redd.it\/4ln4sbv6jjl71.jpg","170":"https:\/\/i.redd.it\/0zy9pdbw3ol71.jpg","171":"https:\/\/i.redd.it\/y20h2td7bkl71.jpg","172":"https:\/\/i.redd.it\/sfmw9rfghnl71.jpg","173":"https:\/\/i.redd.it\/dwkw4q5a0ol71.jpg","174":"https:\/\/v.redd.it\/iw4jaajvwnl71","175":"https:\/\/i.redd.it\/dndxmz0w1ml71.jpg","176":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/piddep\/unpopular_opinion_for_most_people_its_not_a_bad\/","177":"https:\/\/i.redd.it\/94owj81vgkl71.jpg","178":"https:\/\/i.redd.it\/v9crs5jpgnl71.jpg","179":"https:\/\/i.redd.it\/cw6anh1j5nl71.jpg","180":"https:\/\/i.redd.it\/cygcbw2qjjl71.jpg","181":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi8mir\/following_accounts_are_involved_in_an_upvote_for\/","182":"https:\/\/i.redd.it\/m39hsg1dopl71.jpg","183":"https:\/\/i.redd.it\/302v6a8itol71.png","184":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi1owl\/you_know_what_really_pisses_me_off\/","185":"https:\/\/i.imgur.com\/G5wgkrO.jpg","186":"https:\/\/i.imgur.com\/AzZX6vc.jpg","187":"https:\/\/i.redd.it\/f0dd4fe73kl71.jpg","188":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/picrp7\/ethereum_beginner_basics\/","189":"https:\/\/i.redd.it\/dht4x6aa2pl71.jpg","190":"https:\/\/i.redd.it\/p7kcf81kbol71.jpg","191":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi7jgx\/newcomers_hodl_tight_institutions_may_try_to\/","192":"https:\/\/i.redd.it\/vct6anhqwpl71.jpg","193":"https:\/\/i.redd.it\/3zege67qikl71.jpg","194":"https:\/\/i.redd.it\/v6gg5bz9cnl71.jpg","195":"https:\/\/i.redd.it\/qc27tesvanl71.jpg","196":"https:\/\/i.redd.it\/gwbd14necpl71.png","197":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/piebpt\/yefi_ceo_ethereum_to_be_global_computer_bigger\/","198":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pidnxv\/the_big_donts_of_crypto\/","199":"https:\/\/i.redd.it\/i72b63ot5ol71.jpg","200":"https:\/\/i.redd.it\/79wihmhusnl71.jpg","201":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi86n6\/official_website_ethereum_node_will_eventually_be\/","202":"https:\/\/i.redd.it\/2laqgdp5hnl71.jpg","203":"https:\/\/i.redd.it\/2qpao94ssll71.jpg","204":"https:\/\/i.redd.it\/yyiu0wcmppl71.jpg","205":"https:\/\/i.redd.it\/u3mggvt89pl71.png","206":"https:\/\/i.redd.it\/e1uigxzsdpl71.png","207":"https:\/\/i.redd.it\/3t0y79o8zol71.jpg","208":"https:\/\/i.redd.it\/4owu9y9kanl71.jpg","209":"https:\/\/www-businessinsider-com.cdn.ampproject.org\/v\/s\/www.businessinsider.com\/locked-crypto-wallet-password-recovery-cryptocurrency-chris-charlie-brooks-btc-2021-9?amp_js_v=a6&amp;amp_gsa=1&amp;amp&amp;usqp=mq331AQIKAGwASCAAgM%3D#aoh=16307884018447&amp;csi=0&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s","210":"https:\/\/i.redd.it\/scw8a65zfol71.jpg","211":"https:\/\/i.redd.it\/lky55rc9wkl71.jpg","212":"https:\/\/i.redd.it\/v2or6mq1ypl71.png","213":"https:\/\/v.redd.it\/gce8gare1ol71","214":"https:\/\/i.redd.it\/yuowc9ohznl71.jpg","215":"https:\/\/i.redd.it\/bek1m1f9oll71.jpg","216":"https:\/\/ambcrypto.com\/assessing-ethereums-likelihood-of-surging-to-4500-soon\/","217":"https:\/\/i.redd.it\/187m8uuo0pl71.jpg","218":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pid04o\/will_there_be_a_correction\/","219":"https:\/\/i.redd.it\/m4ixkgcfuml71.png","220":"https:\/\/dailyhodl.com\/2021\/09\/04\/ethereum-is-dragging-other-crypto-assets-higher-according-to-chainalysis-ceo-heres-why\/","221":"https:\/\/ambcrypto.com\/sec-refuses-to-produce-documents-related-to-employees-xrp-bitcoin-ethereum-holdings\/","222":"https:\/\/www.theblockcrypto.com\/linked\/116659\/ethereum-negative-daily-emission-eip-1559","223":"https:\/\/i.redd.it\/38yj3z9xipl71.jpg","224":"https:\/\/v.redd.it\/e542dmn8nnl71","225":"https:\/\/www.fxstreet.com\/cryptocurrencies\/news\/ethereum-price-prediction-eth-to-retest-all-time-high-after-minor-pullback-202109050804","226":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pigp49\/dont_get_stressed_out_if_you_see_a_dip\/","227":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi4ss6\/i_have_10k_donut_sitting_from_march_will_it_expire\/","228":"https:\/\/i.redd.it\/ce9b2lbgdql71.png","229":"https:\/\/i.redd.it\/xowy05kt9pl71.jpg","230":"https:\/\/i.redd.it\/slgo7axk2pl71.jpg","231":"https:\/\/markets.businessinsider.com\/news\/stocks\/utopia-p2p-introduces-anonymous-usd-stablecoin-backed-by-dai-1030746801","232":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pibwk4\/7_changes_in_uniswap_v3_and_lp_impacts\/","233":"https:\/\/i.redd.it\/mvo0b719tnl71.jpg","234":"https:\/\/v.redd.it\/jrdu4ls3rnl71","235":"https:\/\/www.cryptopolitan.com\/54m-eth-burned-ethereum-deflationary-day\/","236":"https:\/\/www.benzinga.com\/general\/crowdsourcing\/21\/09\/22809592\/if-you-had-5-000-right-now-would-you-put-it-on-ethereum-or-baby-dogecoin","237":"https:\/\/i.redd.it\/2bqlevl66ql71.jpg","238":"https:\/\/i.redd.it\/lvq0lm3ozpl71.png","239":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/piglmf\/stay_away_from_rcryptomoonshots\/","240":"https:\/\/twitter.com\/DocumentEther\/status\/1434063085229150216","241":"https:\/\/i.redd.it\/z3pqty9t9pl71.png","242":"https:\/\/decrypt.co\/80268\/more-than-200000-eth-burned-by-eip-1559","243":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/piecsj\/when_you_buy_an_nft_you_dont_completely_own_it\/","244":"https:\/\/www.cryptopolitan.com\/ethereum-price-analysis-2021-09-05\/","245":"https:\/\/www.benzinga.com\/markets\/cryptocurrency\/21\/09\/22809946\/new-ethereum-based-nft-project-from-artist-behind-the-bored-ape-yacht-club","246":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pi2uli\/what_can_cause_this_kind_of_spike_in_ethereum\/","247":"https:\/\/dailyhodl.com\/2021\/09\/04\/cryptocurrencies-gain-legal-status-in-texas-as-new-laws-take-effect\/","248":"https:\/\/i.redd.it\/82rz7to8qjl71.jpg","249":"https:\/\/www.youtube.com\/watch?v=-U7Np73mjE0","250":"https:\/\/twitter.com\/RealNatashaChe\/status\/1434184387420213249","251":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pieddt\/tell_me_your_favorite_cryptorelated_joke\/","252":"https:\/\/decrypt.co\/80268\/more-than-200000-eth-burned-by-eip-1559","253":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/pidz4m\/some_benefits_of_a_hardware_wallet\/","254":"https:\/\/cointelegraph.com\/news\/cryptocurrency-can-actually-make-a-difference-by-helping-people\/amp","255":"https:\/\/www.reddit.com\/r\/ethtrader\/comments\/piaeik\/is_it_still_possible_to_claim_donuts_on_xdai\/","256":"https:\/\/www.reddit.com\/r\/BitcoinMarkets\/comments\/pi616p\/daily_discussion_sunday_september_05_2021\/"}}